{
  "reviewResults":[
  {
    "id": 284052,
    "page": 1,
    "results": [
      {
        "id": "581bbdbbc3a36805c60001f1",
        "author": "iheardthatmoviewas",
        "content": "With each new Marvel film one could expect the studio to push the limits of what a superhero film should consist of. Films such as Captain America: Winter Solider, Guardians of the Galaxy and Ant-Man all consisted of elements that we have never seen within a superhero film before. Now, Marvel Studios attempts to push the envelop once more by leaving the world of high tech armors and super soldiers and entering the mystical world of magic. Leading this charge is Benedict Cumberbatch's Doctor Stephen Strange and hopefully he could answer why there is this strange mystical feeling that we have seen this all before.\r\n\r\n\r\n\r\n> From Marvel comes “Doctor Strange,” the story of world-famous neurosurgeon Dr. Stephen Strange whose life changes forever after a horrific car accident robs him of the use of his hands. When traditional medicine fails him, he is forced to look for healing, and hope, in an unlikely place—a mysterious enclave known as Kamar-Taj. He quickly learns that this is not just a center for healing but also the front line of a battle against unseen dark forces bent on destroying our reality. Before long Strange—armed with newly acquired magical powers—is forced to choose whether to return to his life of fortune and status or leave it all behind to defend the world as the most powerful sorcerer in existence.\r\n\r\nI am going to start off the review by discussing the only strong positive thing that came out of Doctor Strange and its by far the visuals. Beautiful vibrant colors pop at you throughout the film, the costume design is beyond extravagant and the framing is spot on. Doctor Strange and his fellow Sorcerers Supremes powers aren't fully on display until they enter the Mirror Dimension and my god, Tony Stark and Bruce Banner would hate this place. As they are men of science, they would hate that all rules of physics are thrown out the window as our Sorcerers Supremes are capable of breaking buildings apart and reforming to however they please. It is hard to not reference Inception but no one here is dreaming, these visuals are being created by the hand of mystical men and they use it to their power.\r\n\r\nIn all honestly, pushing the envelope when it comes to visuals was not a difficult task at all. Heck, if they didn't I would have been extremely disappointed as it was an obvious opportunity to take advantage of since we are dealing with magic. I am still extremely disappointed regardless as director Scott Derrickson completely missed another obvious opportunity to push the envelope this time in regards of character development.\r\n\r\nDoctor Stephen Strange is very much like a Tony Stark and other superheroes we have seen in films before as he is arrogant, egoistical and full of it. After Strange's accident in which he suffered extreme nerve damage to both hands, he dishes out every penny to his name to repair his hands in hopes he could continue his career as neurosurgeon. Every attempt fails and Strange becomes desperate enough to head to Nepal and finds himself under the guidance of Tilda Swinton's The Ancient One. Learning a whole new concept in the mystic arts forces Strange to reshape his way of thinking but Scott Derrickson does not let this have Strange reshape who he is as a person as well.\r\n\r\nDoctor Strange should have found himself being more like a Steve Rogers towards the end of the film as learning the mystic arts and his accident alone should have broken his ego. But instead everything still comes easy to him as he masters magic with ease with very little tension. He has a couple hiccups in the beginning but once The Ancient One puts him under her wing it is smooth sailing and Strange is stealing texts, wielding powerful weapons and defeating Supremes with decades of training with ease.\r\n\r\nYou cannot say that Strange was destined for the mystic arts and that is why everything came so easy for him. Strange is only learning the mystic arts due to circumstance. If he doesn't get into an accident, which happened to him due to being careless, he doesn't find himself in Nepal. Harry Potter was destined for magic, not Strange. Strange fails to grow as a character because he continues to be proven right and no consequences seem to happen due to his actions.\r\n\r\nIt is hard to get into the character development of our supporting characters Benedict Wong's Wong and Chiwetel Ejiofor's Mordo as I would utterly spoil the film for you. All I would say though is that they were both mishandled and deserved better developments. It is a shame too because Wong and Ejiofor are superb actors but wasting talent is something Marvel Studios is used to.\r\n\r\nWhen will Marvel Studios get a villain right?  With Mads Mikkelsen playing our lead villain, Kaecilius, I thought we might finally get a cinematic Marvel villain that is on par to Killgrave and Kingpin over at Marvel's television department. Ultimately, Kaecilius and Doctor Strange end up fighting due to the most silliest cliche: being at the wrong place at the wrong time. The two individuals meet at the New York Sanctum Sanctorum in which Strange accidentally gets blown in to. Kaecilius is there to kill the protector and Sanctum Sanctorum itself and has no knowledge of who Strange is. In fact, he honestly believes Strange's name is in fact \"Mister Doctor.\" Still learning his craft, Strange is capable of putting up a better fight than the protector who should be a matter. I mean, he is a protector after all. There are no stakes for Strange, strange.\r\n\r\nVisually appealing could only get you so far as Doctor Strange fails to focus on the development of their characters that they made so appealing to the eye. Doctor Strange will become a huge asset to the Marvel Cinematic Universe and lets hope we see the rest of Strange's development when he casts his next spell. There is so much untapped potential in Strange's character, we just haven't seen the best of him yet.",
        "url": "https://www.themoviedb.org/review/581bbdbbc3a36805c60001f1"
      },
      {
        "id": "581e7bad9251410a0e01146e",
        "author": "Frank Ochieng",
        "content": "All continues to be well in the Marvel Comics Universe as the film adaptation of another mischievous and majestic superhero from Stan Lee’s printed page empire emerges and reigns supreme on the big screen. The latest cure from the Marvel movie bag of explosive tricks is the entry of the dazzling and decorative **Doctor Strange**. Armed with a collection of notable performers, a convincing colorful scope of visual vibrancy and a hearty touch of spiritual and reflective potency the spellbinding **Doctor Strange** is an engaging and oddly sophisticated action-oriented comic book fantasy adding imaginative flavor to the typical escapist gem from the Marvel stable of powered personalities.\r\n\r\nSome may argue that **Doctor Strange** is merely another conveyor belt cinematic comics confection that follows a safe and similar makeup that constitutes the obligatory Marvel Comics movie foundation–excitable weirdness, overly splashes of wayward whimsy, copious characterizations attached to their brand of eccentric grandeur and larger-than-life gestures of dark and devious exploits grounded in the basic landscape of good versus evil. Listen, sometimes traveling down the conventional path of constructed and adventurous Marvel-made spectacles is not necessarily a bad thing to consider. After all, the well-known and more popular superhero icons such as _Spider-Man_, _The Incredible Hulk_, _Iron Man_, _The Avengers_, and _The X-Men_ for instance seem to benefit nicely from the anticipated formula that routinely delivers the entertaining goods for its avid core of fanboys. So why not wipe off the seemingly obscure and underrated **Doctor Strange** and provide the same kind of popcorn-pulsating mystique for blockbuster cinema?\r\n\r\n**Doctor Strange** started out as a comic book creation in 1963 by Steve Ditko and Stan Lee. Director Scott Derrickson (“Paradise Lost”, “The Exorcism of Emily Rose”, “Sinister”, “Deliver Us From Evil”) does an admirable job in giving shades of bizarre brilliance and magical manipulation to an unconventional Marvel comic book character hardly known for his capacity to translate his mystical mastery to celluloid with compelling curiosity. Derrickson, known primarily for his creative juices in the realm of horror fantasies, confidently serves up the off-kilter and hypnotic appeal of Dr. Stephen Strange as embodied by accomplished English actor Benedict Cumberbatch (“Black Mass”, “The Imitation Game”, “12 Years a Slave”). Interestingly, Derrickson and his handful of screenwriters craft **Doctor Strange** with a mind-blowing measurement of restraint and inquisitiveness. Indeed, **Doctor Strange** echoes its contemporary Marvel-established movies with predictable pluckiness to a certain extent but what is appreciated more is the uniqueness of the film’s ability to emphasize a cerebral superhero that is cut out of a different kind of creative cloth which feels quite distinctive from other brooding Marvel mavericks. Cumberbatch–mastering a rather effective American-accented sorcerer with skill–has injected a degree of inventive nobility and refinement that uplifts this calculating comic-book fantasy.\r\n\r\nCumberbatch’s egotistical Stephen Strange is an incredibly gifted neurosurgeon. His hands are truly miraculous tools of his medical trade and he takes pride in his abilities to treat the critical patients that have tremendous hope courtesy of his therapeutic capabilities. In a nutshell, Strange outshines his other surgical competitors because he is able to give to his patients on the operating table something other doctors cannot instantly muster up. However, cruel fate strikes its ugly head when Strange suffers the usage of his precious hands as a result of a horrific car wreck. The nerves in his hands are destroyed and the non-functioning of his limbs is an awful reminder that his surgical talents are something of the immediate past.\r\n\r\nAs Strange delves into self-pity and surfacing depression he cannot see just how supportive his fellow physician Christine Palmer (Rachel McAdam) is toward him. Clearly, Christine is in love with the alienating medical moper but Strange simply does not realize the extent of her affections because he is too busy sulking about his misfortune. The only factor that gets a promising rise out of Strange is his recent acknowledgement of the Tibetan community where there is a Kamar-Taj temple rumored to restore ailing body parts destined to make an individual “whole” and “complete” once again. Naturally, Strange wants to bypass the tedious and lengthy therapy sessions for a chance to experience the miracle of his once-amazing operating digits now ravaged by severe nerve damage.\r\n\r\nThe main source behind the Kamar-Taj temple’s heralded existence is The Ancient One (played by Tilda Swinton). She is instrumental in teaching the fundamentals of a selected Eastern mysticism that teaches the special concentration of healing the wounded and wasting human body when scientific medical practices fail to do so. Soon, Strange’s affiliation with The Ancient One and her mystical minions has more than a transfixing effect on gaining control of his ailing hands as he gains indescribable powers through the inner strength of mind and soul. Now, Dr. Strange can generate his own alternating state of philosophical wizardry that dictates shaping time and space dimensions. Strange’s out-of-body experiences supersede all his previous physical impairments as a force to be reckoned with at large. Whether observing Strange’s Cloak of Levitation methods or witnessing his supernatural prowess on the mean streets against wickedness Doctor Strange spins a wild and weird web of action-packed surrealism that is a welcomed addition to Marvel Comics’ showcasing of super-heroic protective cads feisty in flaws and frivolity.\r\n\r\nCumberbatch is mesmerizing as the self-absorbed genius Strange who perhaps is the best complex Marvel-related protagonist since Robert Downey Jr.’s flippant Tony Stark/Iron Man. The combination of heightened arrogance and high-brow self-doubt and vulnerability tactically works as Cumberbatch sells this portrayal solidly. Although Swinton’s The Ancient One is an intriguing enigma in her own right one must question why the absence of an Asian actor not considered for this particular role may have some scratching their heads in indignation? McAdam’s love interest Christine amounts to only being an afterthought not just in the eyes of her object of affection Strange but to the audience as well.\r\n\r\nThankfully, the other supporting players contribute marvelously to the festivities. Oscar nominee Chiwetel Ejiofor (Cumberbatch’s co-star from the Academy Award-winning “12 Years a Slave”) plays fellow sorcerer Mordo while Benedict Wong assumes the duty as another one of The Ancient One’s followers who guards the school’s sacred scriptures. Mads Mikkelsen is devilishly received as Kaecilius, the former disciple of The Ancient One gone rogue whose agenda in releasing an ominous demon Dormammu to the world will test the will of Doc Strange’s newfound mystical techniques and tactics.\r\n\r\nNo doubt that **Doctor Strange** is an impeccably surging superhero fable laced with stunning aesthetics and a richly robust score by Michael Giachinno. The high caliber of talent associated with this spry comic book actioner definitely ensures another superhero film franchise-in-the-making as Cumberbatch’s introspective doc administers his **Strange** dosage of Marvel movie-making medicine for the ages.\r\n\r\n**Doctor Strange** (2016)\r\n\r\nWalt Disney Pictures\r\n\r\n2 hrs. 10 mins.\r\n\r\nStarring: Benedict Cumberbatch, Tilda Swinton, Chiwetel Ejiofor, Mads Mikkelsen, Rachel McAdam, Benedict Wong, Benjamin Bratt\r\n\r\nDirected by: Scott Derrickson\r\n\r\nMPAA Rating: PG-13\r\n\r\nGenre: Science Fiction & Fantasy/Action & Adventures/Comic Book Fable\r\n\r\nCritic’s rating: *** 1/2 (out of 4 stars)\r\n\r\n(c) **Frank Ochieng** 2016",
        "url": "https://www.themoviedb.org/review/581e7bad9251410a0e01146e"
      },
      {
        "id": "582540379251417b2c0033e2",
        "author": "Gimly",
        "content": "Though the core events may not be anything new for the MCU, particularly in so far as its origin stories go (Stephen Strange's A-to-B is virtually identical to Tony Stark's in the first _Iron Man_ film) the psychedelic filter through which we experience these events is entirely fresh!\r\n\r\nNot all of the humour lands, and in fact sometimes actually detracts from the story. While the effects are very impressive from a conceptual angle, the graphical end-products do sometimes fall short. Benedict Cumberbatch is a fantastic actor, and does a fine job as Doctor Strange, virtually the whole cast are proven actors, but none are really given the chance to flex those acting muscles to any sort of a newly impressive degree.\r\n\r\nThose minor nitpicks aside, _Doctor Strange_ is another very successful entry to the MCU, just further proving that Marvel really know what they're doing in this latest form the film industry has taken.\r\n\r\n_Final rating:★★★½ - I strongly recommend you make the time._",
        "url": "https://www.themoviedb.org/review/582540379251417b2c0033e2"
      }
    ],
    "total_pages": 1,
    "total_results": 3
  },
  {
    "id": 284052,
    "page": 1,
    "results": [
      {
        "id": "581bbdbbc3a36805c60001f1",
        "author": "iheardthatmoviewas",
        "content": "With each new Marvel film one could expect the studio to push the limits of what a superhero film should consist of. Films such as Captain America: Winter Solider, Guardians of the Galaxy and Ant-Man all consisted of elements that we have never seen within a superhero film before. Now, Marvel Studios attempts to push the envelop once more by leaving the world of high tech armors and super soldiers and entering the mystical world of magic. Leading this charge is Benedict Cumberbatch's Doctor Stephen Strange and hopefully he could answer why there is this strange mystical feeling that we have seen this all before.\r\n\r\n\r\n\r\n> From Marvel comes “Doctor Strange,” the story of world-famous neurosurgeon Dr. Stephen Strange whose life changes forever after a horrific car accident robs him of the use of his hands. When traditional medicine fails him, he is forced to look for healing, and hope, in an unlikely place—a mysterious enclave known as Kamar-Taj. He quickly learns that this is not just a center for healing but also the front line of a battle against unseen dark forces bent on destroying our reality. Before long Strange—armed with newly acquired magical powers—is forced to choose whether to return to his life of fortune and status or leave it all behind to defend the world as the most powerful sorcerer in existence.\r\n\r\nI am going to start off the review by discussing the only strong positive thing that came out of Doctor Strange and its by far the visuals. Beautiful vibrant colors pop at you throughout the film, the costume design is beyond extravagant and the framing is spot on. Doctor Strange and his fellow Sorcerers Supremes powers aren't fully on display until they enter the Mirror Dimension and my god, Tony Stark and Bruce Banner would hate this place. As they are men of science, they would hate that all rules of physics are thrown out the window as our Sorcerers Supremes are capable of breaking buildings apart and reforming to however they please. It is hard to not reference Inception but no one here is dreaming, these visuals are being created by the hand of mystical men and they use it to their power.\r\n\r\nIn all honestly, pushing the envelope when it comes to visuals was not a difficult task at all. Heck, if they didn't I would have been extremely disappointed as it was an obvious opportunity to take advantage of since we are dealing with magic. I am still extremely disappointed regardless as director Scott Derrickson completely missed another obvious opportunity to push the envelope this time in regards of character development.\r\n\r\nDoctor Stephen Strange is very much like a Tony Stark and other superheroes we have seen in films before as he is arrogant, egoistical and full of it. After Strange's accident in which he suffered extreme nerve damage to both hands, he dishes out every penny to his name to repair his hands in hopes he could continue his career as neurosurgeon. Every attempt fails and Strange becomes desperate enough to head to Nepal and finds himself under the guidance of Tilda Swinton's The Ancient One. Learning a whole new concept in the mystic arts forces Strange to reshape his way of thinking but Scott Derrickson does not let this have Strange reshape who he is as a person as well.\r\n\r\nDoctor Strange should have found himself being more like a Steve Rogers towards the end of the film as learning the mystic arts and his accident alone should have broken his ego. But instead everything still comes easy to him as he masters magic with ease with very little tension. He has a couple hiccups in the beginning but once The Ancient One puts him under her wing it is smooth sailing and Strange is stealing texts, wielding powerful weapons and defeating Supremes with decades of training with ease.\r\n\r\nYou cannot say that Strange was destined for the mystic arts and that is why everything came so easy for him. Strange is only learning the mystic arts due to circumstance. If he doesn't get into an accident, which happened to him due to being careless, he doesn't find himself in Nepal. Harry Potter was destined for magic, not Strange. Strange fails to grow as a character because he continues to be proven right and no consequences seem to happen due to his actions.\r\n\r\nIt is hard to get into the character development of our supporting characters Benedict Wong's Wong and Chiwetel Ejiofor's Mordo as I would utterly spoil the film for you. All I would say though is that they were both mishandled and deserved better developments. It is a shame too because Wong and Ejiofor are superb actors but wasting talent is something Marvel Studios is used to.\r\n\r\nWhen will Marvel Studios get a villain right?  With Mads Mikkelsen playing our lead villain, Kaecilius, I thought we might finally get a cinematic Marvel villain that is on par to Killgrave and Kingpin over at Marvel's television department. Ultimately, Kaecilius and Doctor Strange end up fighting due to the most silliest cliche: being at the wrong place at the wrong time. The two individuals meet at the New York Sanctum Sanctorum in which Strange accidentally gets blown in to. Kaecilius is there to kill the protector and Sanctum Sanctorum itself and has no knowledge of who Strange is. In fact, he honestly believes Strange's name is in fact \"Mister Doctor.\" Still learning his craft, Strange is capable of putting up a better fight than the protector who should be a matter. I mean, he is a protector after all. There are no stakes for Strange, strange.\r\n\r\nVisually appealing could only get you so far as Doctor Strange fails to focus on the development of their characters that they made so appealing to the eye. Doctor Strange will become a huge asset to the Marvel Cinematic Universe and lets hope we see the rest of Strange's development when he casts his next spell. There is so much untapped potential in Strange's character, we just haven't seen the best of him yet.",
        "url": "https://www.themoviedb.org/review/581bbdbbc3a36805c60001f1"
      },
      {
        "id": "581e7bad9251410a0e01146e",
        "author": "Frank Ochieng",
        "content": "All continues to be well in the Marvel Comics Universe as the film adaptation of another mischievous and majestic superhero from Stan Lee’s printed page empire emerges and reigns supreme on the big screen. The latest cure from the Marvel movie bag of explosive tricks is the entry of the dazzling and decorative **Doctor Strange**. Armed with a collection of notable performers, a convincing colorful scope of visual vibrancy and a hearty touch of spiritual and reflective potency the spellbinding **Doctor Strange** is an engaging and oddly sophisticated action-oriented comic book fantasy adding imaginative flavor to the typical escapist gem from the Marvel stable of powered personalities.\r\n\r\nSome may argue that **Doctor Strange** is merely another conveyor belt cinematic comics confection that follows a safe and similar makeup that constitutes the obligatory Marvel Comics movie foundation–excitable weirdness, overly splashes of wayward whimsy, copious characterizations attached to their brand of eccentric grandeur and larger-than-life gestures of dark and devious exploits grounded in the basic landscape of good versus evil. Listen, sometimes traveling down the conventional path of constructed and adventurous Marvel-made spectacles is not necessarily a bad thing to consider. After all, the well-known and more popular superhero icons such as _Spider-Man_, _The Incredible Hulk_, _Iron Man_, _The Avengers_, and _The X-Men_ for instance seem to benefit nicely from the anticipated formula that routinely delivers the entertaining goods for its avid core of fanboys. So why not wipe off the seemingly obscure and underrated **Doctor Strange** and provide the same kind of popcorn-pulsating mystique for blockbuster cinema?\r\n\r\n**Doctor Strange** started out as a comic book creation in 1963 by Steve Ditko and Stan Lee. Director Scott Derrickson (“Paradise Lost”, “The Exorcism of Emily Rose”, “Sinister”, “Deliver Us From Evil”) does an admirable job in giving shades of bizarre brilliance and magical manipulation to an unconventional Marvel comic book character hardly known for his capacity to translate his mystical mastery to celluloid with compelling curiosity. Derrickson, known primarily for his creative juices in the realm of horror fantasies, confidently serves up the off-kilter and hypnotic appeal of Dr. Stephen Strange as embodied by accomplished English actor Benedict Cumberbatch (“Black Mass”, “The Imitation Game”, “12 Years a Slave”). Interestingly, Derrickson and his handful of screenwriters craft **Doctor Strange** with a mind-blowing measurement of restraint and inquisitiveness. Indeed, **Doctor Strange** echoes its contemporary Marvel-established movies with predictable pluckiness to a certain extent but what is appreciated more is the uniqueness of the film’s ability to emphasize a cerebral superhero that is cut out of a different kind of creative cloth which feels quite distinctive from other brooding Marvel mavericks. Cumberbatch–mastering a rather effective American-accented sorcerer with skill–has injected a degree of inventive nobility and refinement that uplifts this calculating comic-book fantasy.\r\n\r\nCumberbatch’s egotistical Stephen Strange is an incredibly gifted neurosurgeon. His hands are truly miraculous tools of his medical trade and he takes pride in his abilities to treat the critical patients that have tremendous hope courtesy of his therapeutic capabilities. In a nutshell, Strange outshines his other surgical competitors because he is able to give to his patients on the operating table something other doctors cannot instantly muster up. However, cruel fate strikes its ugly head when Strange suffers the usage of his precious hands as a result of a horrific car wreck. The nerves in his hands are destroyed and the non-functioning of his limbs is an awful reminder that his surgical talents are something of the immediate past.\r\n\r\nAs Strange delves into self-pity and surfacing depression he cannot see just how supportive his fellow physician Christine Palmer (Rachel McAdam) is toward him. Clearly, Christine is in love with the alienating medical moper but Strange simply does not realize the extent of her affections because he is too busy sulking about his misfortune. The only factor that gets a promising rise out of Strange is his recent acknowledgement of the Tibetan community where there is a Kamar-Taj temple rumored to restore ailing body parts destined to make an individual “whole” and “complete” once again. Naturally, Strange wants to bypass the tedious and lengthy therapy sessions for a chance to experience the miracle of his once-amazing operating digits now ravaged by severe nerve damage.\r\n\r\nThe main source behind the Kamar-Taj temple’s heralded existence is The Ancient One (played by Tilda Swinton). She is instrumental in teaching the fundamentals of a selected Eastern mysticism that teaches the special concentration of healing the wounded and wasting human body when scientific medical practices fail to do so. Soon, Strange’s affiliation with The Ancient One and her mystical minions has more than a transfixing effect on gaining control of his ailing hands as he gains indescribable powers through the inner strength of mind and soul. Now, Dr. Strange can generate his own alternating state of philosophical wizardry that dictates shaping time and space dimensions. Strange’s out-of-body experiences supersede all his previous physical impairments as a force to be reckoned with at large. Whether observing Strange’s Cloak of Levitation methods or witnessing his supernatural prowess on the mean streets against wickedness Doctor Strange spins a wild and weird web of action-packed surrealism that is a welcomed addition to Marvel Comics’ showcasing of super-heroic protective cads feisty in flaws and frivolity.\r\n\r\nCumberbatch is mesmerizing as the self-absorbed genius Strange who perhaps is the best complex Marvel-related protagonist since Robert Downey Jr.’s flippant Tony Stark/Iron Man. The combination of heightened arrogance and high-brow self-doubt and vulnerability tactically works as Cumberbatch sells this portrayal solidly. Although Swinton’s The Ancient One is an intriguing enigma in her own right one must question why the absence of an Asian actor not considered for this particular role may have some scratching their heads in indignation? McAdam’s love interest Christine amounts to only being an afterthought not just in the eyes of her object of affection Strange but to the audience as well.\r\n\r\nThankfully, the other supporting players contribute marvelously to the festivities. Oscar nominee Chiwetel Ejiofor (Cumberbatch’s co-star from the Academy Award-winning “12 Years a Slave”) plays fellow sorcerer Mordo while Benedict Wong assumes the duty as another one of The Ancient One’s followers who guards the school’s sacred scriptures. Mads Mikkelsen is devilishly received as Kaecilius, the former disciple of The Ancient One gone rogue whose agenda in releasing an ominous demon Dormammu to the world will test the will of Doc Strange’s newfound mystical techniques and tactics.\r\n\r\nNo doubt that **Doctor Strange** is an impeccably surging superhero fable laced with stunning aesthetics and a richly robust score by Michael Giachinno. The high caliber of talent associated with this spry comic book actioner definitely ensures another superhero film franchise-in-the-making as Cumberbatch’s introspective doc administers his **Strange** dosage of Marvel movie-making medicine for the ages.\r\n\r\n**Doctor Strange** (2016)\r\n\r\nWalt Disney Pictures\r\n\r\n2 hrs. 10 mins.\r\n\r\nStarring: Benedict Cumberbatch, Tilda Swinton, Chiwetel Ejiofor, Mads Mikkelsen, Rachel McAdam, Benedict Wong, Benjamin Bratt\r\n\r\nDirected by: Scott Derrickson\r\n\r\nMPAA Rating: PG-13\r\n\r\nGenre: Science Fiction & Fantasy/Action & Adventures/Comic Book Fable\r\n\r\nCritic’s rating: *** 1/2 (out of 4 stars)\r\n\r\n(c) **Frank Ochieng** 2016",
        "url": "https://www.themoviedb.org/review/581e7bad9251410a0e01146e"
      },
      {
        "id": "582540379251417b2c0033e2",
        "author": "Gimly",
        "content": "Though the core events may not be anything new for the MCU, particularly in so far as its origin stories go (Stephen Strange's A-to-B is virtually identical to Tony Stark's in the first _Iron Man_ film) the psychedelic filter through which we experience these events is entirely fresh!\r\n\r\nNot all of the humour lands, and in fact sometimes actually detracts from the story. While the effects are very impressive from a conceptual angle, the graphical end-products do sometimes fall short. Benedict Cumberbatch is a fantastic actor, and does a fine job as Doctor Strange, virtually the whole cast are proven actors, but none are really given the chance to flex those acting muscles to any sort of a newly impressive degree.\r\n\r\nThose minor nitpicks aside, _Doctor Strange_ is another very successful entry to the MCU, just further proving that Marvel really know what they're doing in this latest form the film industry has taken.\r\n\r\n_Final rating:★★★½ - I strongly recommend you make the time._",
        "url": "https://www.themoviedb.org/review/582540379251417b2c0033e2"
      }
    ],
    "total_pages": 1,
    "total_results": 3
  },
  {
    "id": 284052,
    "page": 1,
    "results": [
      {
        "id": "581bbdbbc3a36805c60001f1",
        "author": "iheardthatmoviewas",
        "content": "With each new Marvel film one could expect the studio to push the limits of what a superhero film should consist of. Films such as Captain America: Winter Solider, Guardians of the Galaxy and Ant-Man all consisted of elements that we have never seen within a superhero film before. Now, Marvel Studios attempts to push the envelop once more by leaving the world of high tech armors and super soldiers and entering the mystical world of magic. Leading this charge is Benedict Cumberbatch's Doctor Stephen Strange and hopefully he could answer why there is this strange mystical feeling that we have seen this all before.\r\n\r\n\r\n\r\n> From Marvel comes “Doctor Strange,” the story of world-famous neurosurgeon Dr. Stephen Strange whose life changes forever after a horrific car accident robs him of the use of his hands. When traditional medicine fails him, he is forced to look for healing, and hope, in an unlikely place—a mysterious enclave known as Kamar-Taj. He quickly learns that this is not just a center for healing but also the front line of a battle against unseen dark forces bent on destroying our reality. Before long Strange—armed with newly acquired magical powers—is forced to choose whether to return to his life of fortune and status or leave it all behind to defend the world as the most powerful sorcerer in existence.\r\n\r\nI am going to start off the review by discussing the only strong positive thing that came out of Doctor Strange and its by far the visuals. Beautiful vibrant colors pop at you throughout the film, the costume design is beyond extravagant and the framing is spot on. Doctor Strange and his fellow Sorcerers Supremes powers aren't fully on display until they enter the Mirror Dimension and my god, Tony Stark and Bruce Banner would hate this place. As they are men of science, they would hate that all rules of physics are thrown out the window as our Sorcerers Supremes are capable of breaking buildings apart and reforming to however they please. It is hard to not reference Inception but no one here is dreaming, these visuals are being created by the hand of mystical men and they use it to their power.\r\n\r\nIn all honestly, pushing the envelope when it comes to visuals was not a difficult task at all. Heck, if they didn't I would have been extremely disappointed as it was an obvious opportunity to take advantage of since we are dealing with magic. I am still extremely disappointed regardless as director Scott Derrickson completely missed another obvious opportunity to push the envelope this time in regards of character development.\r\n\r\nDoctor Stephen Strange is very much like a Tony Stark and other superheroes we have seen in films before as he is arrogant, egoistical and full of it. After Strange's accident in which he suffered extreme nerve damage to both hands, he dishes out every penny to his name to repair his hands in hopes he could continue his career as neurosurgeon. Every attempt fails and Strange becomes desperate enough to head to Nepal and finds himself under the guidance of Tilda Swinton's The Ancient One. Learning a whole new concept in the mystic arts forces Strange to reshape his way of thinking but Scott Derrickson does not let this have Strange reshape who he is as a person as well.\r\n\r\nDoctor Strange should have found himself being more like a Steve Rogers towards the end of the film as learning the mystic arts and his accident alone should have broken his ego. But instead everything still comes easy to him as he masters magic with ease with very little tension. He has a couple hiccups in the beginning but once The Ancient One puts him under her wing it is smooth sailing and Strange is stealing texts, wielding powerful weapons and defeating Supremes with decades of training with ease.\r\n\r\nYou cannot say that Strange was destined for the mystic arts and that is why everything came so easy for him. Strange is only learning the mystic arts due to circumstance. If he doesn't get into an accident, which happened to him due to being careless, he doesn't find himself in Nepal. Harry Potter was destined for magic, not Strange. Strange fails to grow as a character because he continues to be proven right and no consequences seem to happen due to his actions.\r\n\r\nIt is hard to get into the character development of our supporting characters Benedict Wong's Wong and Chiwetel Ejiofor's Mordo as I would utterly spoil the film for you. All I would say though is that they were both mishandled and deserved better developments. It is a shame too because Wong and Ejiofor are superb actors but wasting talent is something Marvel Studios is used to.\r\n\r\nWhen will Marvel Studios get a villain right?  With Mads Mikkelsen playing our lead villain, Kaecilius, I thought we might finally get a cinematic Marvel villain that is on par to Killgrave and Kingpin over at Marvel's television department. Ultimately, Kaecilius and Doctor Strange end up fighting due to the most silliest cliche: being at the wrong place at the wrong time. The two individuals meet at the New York Sanctum Sanctorum in which Strange accidentally gets blown in to. Kaecilius is there to kill the protector and Sanctum Sanctorum itself and has no knowledge of who Strange is. In fact, he honestly believes Strange's name is in fact \"Mister Doctor.\" Still learning his craft, Strange is capable of putting up a better fight than the protector who should be a matter. I mean, he is a protector after all. There are no stakes for Strange, strange.\r\n\r\nVisually appealing could only get you so far as Doctor Strange fails to focus on the development of their characters that they made so appealing to the eye. Doctor Strange will become a huge asset to the Marvel Cinematic Universe and lets hope we see the rest of Strange's development when he casts his next spell. There is so much untapped potential in Strange's character, we just haven't seen the best of him yet.",
        "url": "https://www.themoviedb.org/review/581bbdbbc3a36805c60001f1"
      },
      {
        "id": "581e7bad9251410a0e01146e",
        "author": "Frank Ochieng",
        "content": "All continues to be well in the Marvel Comics Universe as the film adaptation of another mischievous and majestic superhero from Stan Lee’s printed page empire emerges and reigns supreme on the big screen. The latest cure from the Marvel movie bag of explosive tricks is the entry of the dazzling and decorative **Doctor Strange**. Armed with a collection of notable performers, a convincing colorful scope of visual vibrancy and a hearty touch of spiritual and reflective potency the spellbinding **Doctor Strange** is an engaging and oddly sophisticated action-oriented comic book fantasy adding imaginative flavor to the typical escapist gem from the Marvel stable of powered personalities.\r\n\r\nSome may argue that **Doctor Strange** is merely another conveyor belt cinematic comics confection that follows a safe and similar makeup that constitutes the obligatory Marvel Comics movie foundation–excitable weirdness, overly splashes of wayward whimsy, copious characterizations attached to their brand of eccentric grandeur and larger-than-life gestures of dark and devious exploits grounded in the basic landscape of good versus evil. Listen, sometimes traveling down the conventional path of constructed and adventurous Marvel-made spectacles is not necessarily a bad thing to consider. After all, the well-known and more popular superhero icons such as _Spider-Man_, _The Incredible Hulk_, _Iron Man_, _The Avengers_, and _The X-Men_ for instance seem to benefit nicely from the anticipated formula that routinely delivers the entertaining goods for its avid core of fanboys. So why not wipe off the seemingly obscure and underrated **Doctor Strange** and provide the same kind of popcorn-pulsating mystique for blockbuster cinema?\r\n\r\n**Doctor Strange** started out as a comic book creation in 1963 by Steve Ditko and Stan Lee. Director Scott Derrickson (“Paradise Lost”, “The Exorcism of Emily Rose”, “Sinister”, “Deliver Us From Evil”) does an admirable job in giving shades of bizarre brilliance and magical manipulation to an unconventional Marvel comic book character hardly known for his capacity to translate his mystical mastery to celluloid with compelling curiosity. Derrickson, known primarily for his creative juices in the realm of horror fantasies, confidently serves up the off-kilter and hypnotic appeal of Dr. Stephen Strange as embodied by accomplished English actor Benedict Cumberbatch (“Black Mass”, “The Imitation Game”, “12 Years a Slave”). Interestingly, Derrickson and his handful of screenwriters craft **Doctor Strange** with a mind-blowing measurement of restraint and inquisitiveness. Indeed, **Doctor Strange** echoes its contemporary Marvel-established movies with predictable pluckiness to a certain extent but what is appreciated more is the uniqueness of the film’s ability to emphasize a cerebral superhero that is cut out of a different kind of creative cloth which feels quite distinctive from other brooding Marvel mavericks. Cumberbatch–mastering a rather effective American-accented sorcerer with skill–has injected a degree of inventive nobility and refinement that uplifts this calculating comic-book fantasy.\r\n\r\nCumberbatch’s egotistical Stephen Strange is an incredibly gifted neurosurgeon. His hands are truly miraculous tools of his medical trade and he takes pride in his abilities to treat the critical patients that have tremendous hope courtesy of his therapeutic capabilities. In a nutshell, Strange outshines his other surgical competitors because he is able to give to his patients on the operating table something other doctors cannot instantly muster up. However, cruel fate strikes its ugly head when Strange suffers the usage of his precious hands as a result of a horrific car wreck. The nerves in his hands are destroyed and the non-functioning of his limbs is an awful reminder that his surgical talents are something of the immediate past.\r\n\r\nAs Strange delves into self-pity and surfacing depression he cannot see just how supportive his fellow physician Christine Palmer (Rachel McAdam) is toward him. Clearly, Christine is in love with the alienating medical moper but Strange simply does not realize the extent of her affections because he is too busy sulking about his misfortune. The only factor that gets a promising rise out of Strange is his recent acknowledgement of the Tibetan community where there is a Kamar-Taj temple rumored to restore ailing body parts destined to make an individual “whole” and “complete” once again. Naturally, Strange wants to bypass the tedious and lengthy therapy sessions for a chance to experience the miracle of his once-amazing operating digits now ravaged by severe nerve damage.\r\n\r\nThe main source behind the Kamar-Taj temple’s heralded existence is The Ancient One (played by Tilda Swinton). She is instrumental in teaching the fundamentals of a selected Eastern mysticism that teaches the special concentration of healing the wounded and wasting human body when scientific medical practices fail to do so. Soon, Strange’s affiliation with The Ancient One and her mystical minions has more than a transfixing effect on gaining control of his ailing hands as he gains indescribable powers through the inner strength of mind and soul. Now, Dr. Strange can generate his own alternating state of philosophical wizardry that dictates shaping time and space dimensions. Strange’s out-of-body experiences supersede all his previous physical impairments as a force to be reckoned with at large. Whether observing Strange’s Cloak of Levitation methods or witnessing his supernatural prowess on the mean streets against wickedness Doctor Strange spins a wild and weird web of action-packed surrealism that is a welcomed addition to Marvel Comics’ showcasing of super-heroic protective cads feisty in flaws and frivolity.\r\n\r\nCumberbatch is mesmerizing as the self-absorbed genius Strange who perhaps is the best complex Marvel-related protagonist since Robert Downey Jr.’s flippant Tony Stark/Iron Man. The combination of heightened arrogance and high-brow self-doubt and vulnerability tactically works as Cumberbatch sells this portrayal solidly. Although Swinton’s The Ancient One is an intriguing enigma in her own right one must question why the absence of an Asian actor not considered for this particular role may have some scratching their heads in indignation? McAdam’s love interest Christine amounts to only being an afterthought not just in the eyes of her object of affection Strange but to the audience as well.\r\n\r\nThankfully, the other supporting players contribute marvelously to the festivities. Oscar nominee Chiwetel Ejiofor (Cumberbatch’s co-star from the Academy Award-winning “12 Years a Slave”) plays fellow sorcerer Mordo while Benedict Wong assumes the duty as another one of The Ancient One’s followers who guards the school’s sacred scriptures. Mads Mikkelsen is devilishly received as Kaecilius, the former disciple of The Ancient One gone rogue whose agenda in releasing an ominous demon Dormammu to the world will test the will of Doc Strange’s newfound mystical techniques and tactics.\r\n\r\nNo doubt that **Doctor Strange** is an impeccably surging superhero fable laced with stunning aesthetics and a richly robust score by Michael Giachinno. The high caliber of talent associated with this spry comic book actioner definitely ensures another superhero film franchise-in-the-making as Cumberbatch’s introspective doc administers his **Strange** dosage of Marvel movie-making medicine for the ages.\r\n\r\n**Doctor Strange** (2016)\r\n\r\nWalt Disney Pictures\r\n\r\n2 hrs. 10 mins.\r\n\r\nStarring: Benedict Cumberbatch, Tilda Swinton, Chiwetel Ejiofor, Mads Mikkelsen, Rachel McAdam, Benedict Wong, Benjamin Bratt\r\n\r\nDirected by: Scott Derrickson\r\n\r\nMPAA Rating: PG-13\r\n\r\nGenre: Science Fiction & Fantasy/Action & Adventures/Comic Book Fable\r\n\r\nCritic’s rating: *** 1/2 (out of 4 stars)\r\n\r\n(c) **Frank Ochieng** 2016",
        "url": "https://www.themoviedb.org/review/581e7bad9251410a0e01146e"
      },
      {
        "id": "582540379251417b2c0033e2",
        "author": "Gimly",
        "content": "Though the core events may not be anything new for the MCU, particularly in so far as its origin stories go (Stephen Strange's A-to-B is virtually identical to Tony Stark's in the first _Iron Man_ film) the psychedelic filter through which we experience these events is entirely fresh!\r\n\r\nNot all of the humour lands, and in fact sometimes actually detracts from the story. While the effects are very impressive from a conceptual angle, the graphical end-products do sometimes fall short. Benedict Cumberbatch is a fantastic actor, and does a fine job as Doctor Strange, virtually the whole cast are proven actors, but none are really given the chance to flex those acting muscles to any sort of a newly impressive degree.\r\n\r\nThose minor nitpicks aside, _Doctor Strange_ is another very successful entry to the MCU, just further proving that Marvel really know what they're doing in this latest form the film industry has taken.\r\n\r\n_Final rating:★★★½ - I strongly recommend you make the time._",
        "url": "https://www.themoviedb.org/review/582540379251417b2c0033e2"
      }
    ],
    "total_pages": 1,
    "total_results": 3
  },
  {
    "id": 284052,
    "page": 1,
    "results": [
      {
        "id": "581bbdbbc3a36805c60001f1",
        "author": "iheardthatmoviewas",
        "content": "With each new Marvel film one could expect the studio to push the limits of what a superhero film should consist of. Films such as Captain America: Winter Solider, Guardians of the Galaxy and Ant-Man all consisted of elements that we have never seen within a superhero film before. Now, Marvel Studios attempts to push the envelop once more by leaving the world of high tech armors and super soldiers and entering the mystical world of magic. Leading this charge is Benedict Cumberbatch's Doctor Stephen Strange and hopefully he could answer why there is this strange mystical feeling that we have seen this all before.\r\n\r\n\r\n\r\n> From Marvel comes “Doctor Strange,” the story of world-famous neurosurgeon Dr. Stephen Strange whose life changes forever after a horrific car accident robs him of the use of his hands. When traditional medicine fails him, he is forced to look for healing, and hope, in an unlikely place—a mysterious enclave known as Kamar-Taj. He quickly learns that this is not just a center for healing but also the front line of a battle against unseen dark forces bent on destroying our reality. Before long Strange—armed with newly acquired magical powers—is forced to choose whether to return to his life of fortune and status or leave it all behind to defend the world as the most powerful sorcerer in existence.\r\n\r\nI am going to start off the review by discussing the only strong positive thing that came out of Doctor Strange and its by far the visuals. Beautiful vibrant colors pop at you throughout the film, the costume design is beyond extravagant and the framing is spot on. Doctor Strange and his fellow Sorcerers Supremes powers aren't fully on display until they enter the Mirror Dimension and my god, Tony Stark and Bruce Banner would hate this place. As they are men of science, they would hate that all rules of physics are thrown out the window as our Sorcerers Supremes are capable of breaking buildings apart and reforming to however they please. It is hard to not reference Inception but no one here is dreaming, these visuals are being created by the hand of mystical men and they use it to their power.\r\n\r\nIn all honestly, pushing the envelope when it comes to visuals was not a difficult task at all. Heck, if they didn't I would have been extremely disappointed as it was an obvious opportunity to take advantage of since we are dealing with magic. I am still extremely disappointed regardless as director Scott Derrickson completely missed another obvious opportunity to push the envelope this time in regards of character development.\r\n\r\nDoctor Stephen Strange is very much like a Tony Stark and other superheroes we have seen in films before as he is arrogant, egoistical and full of it. After Strange's accident in which he suffered extreme nerve damage to both hands, he dishes out every penny to his name to repair his hands in hopes he could continue his career as neurosurgeon. Every attempt fails and Strange becomes desperate enough to head to Nepal and finds himself under the guidance of Tilda Swinton's The Ancient One. Learning a whole new concept in the mystic arts forces Strange to reshape his way of thinking but Scott Derrickson does not let this have Strange reshape who he is as a person as well.\r\n\r\nDoctor Strange should have found himself being more like a Steve Rogers towards the end of the film as learning the mystic arts and his accident alone should have broken his ego. But instead everything still comes easy to him as he masters magic with ease with very little tension. He has a couple hiccups in the beginning but once The Ancient One puts him under her wing it is smooth sailing and Strange is stealing texts, wielding powerful weapons and defeating Supremes with decades of training with ease.\r\n\r\nYou cannot say that Strange was destined for the mystic arts and that is why everything came so easy for him. Strange is only learning the mystic arts due to circumstance. If he doesn't get into an accident, which happened to him due to being careless, he doesn't find himself in Nepal. Harry Potter was destined for magic, not Strange. Strange fails to grow as a character because he continues to be proven right and no consequences seem to happen due to his actions.\r\n\r\nIt is hard to get into the character development of our supporting characters Benedict Wong's Wong and Chiwetel Ejiofor's Mordo as I would utterly spoil the film for you. All I would say though is that they were both mishandled and deserved better developments. It is a shame too because Wong and Ejiofor are superb actors but wasting talent is something Marvel Studios is used to.\r\n\r\nWhen will Marvel Studios get a villain right?  With Mads Mikkelsen playing our lead villain, Kaecilius, I thought we might finally get a cinematic Marvel villain that is on par to Killgrave and Kingpin over at Marvel's television department. Ultimately, Kaecilius and Doctor Strange end up fighting due to the most silliest cliche: being at the wrong place at the wrong time. The two individuals meet at the New York Sanctum Sanctorum in which Strange accidentally gets blown in to. Kaecilius is there to kill the protector and Sanctum Sanctorum itself and has no knowledge of who Strange is. In fact, he honestly believes Strange's name is in fact \"Mister Doctor.\" Still learning his craft, Strange is capable of putting up a better fight than the protector who should be a matter. I mean, he is a protector after all. There are no stakes for Strange, strange.\r\n\r\nVisually appealing could only get you so far as Doctor Strange fails to focus on the development of their characters that they made so appealing to the eye. Doctor Strange will become a huge asset to the Marvel Cinematic Universe and lets hope we see the rest of Strange's development when he casts his next spell. There is so much untapped potential in Strange's character, we just haven't seen the best of him yet.",
        "url": "https://www.themoviedb.org/review/581bbdbbc3a36805c60001f1"
      },
      {
        "id": "581e7bad9251410a0e01146e",
        "author": "Frank Ochieng",
        "content": "All continues to be well in the Marvel Comics Universe as the film adaptation of another mischievous and majestic superhero from Stan Lee’s printed page empire emerges and reigns supreme on the big screen. The latest cure from the Marvel movie bag of explosive tricks is the entry of the dazzling and decorative **Doctor Strange**. Armed with a collection of notable performers, a convincing colorful scope of visual vibrancy and a hearty touch of spiritual and reflective potency the spellbinding **Doctor Strange** is an engaging and oddly sophisticated action-oriented comic book fantasy adding imaginative flavor to the typical escapist gem from the Marvel stable of powered personalities.\r\n\r\nSome may argue that **Doctor Strange** is merely another conveyor belt cinematic comics confection that follows a safe and similar makeup that constitutes the obligatory Marvel Comics movie foundation–excitable weirdness, overly splashes of wayward whimsy, copious characterizations attached to their brand of eccentric grandeur and larger-than-life gestures of dark and devious exploits grounded in the basic landscape of good versus evil. Listen, sometimes traveling down the conventional path of constructed and adventurous Marvel-made spectacles is not necessarily a bad thing to consider. After all, the well-known and more popular superhero icons such as _Spider-Man_, _The Incredible Hulk_, _Iron Man_, _The Avengers_, and _The X-Men_ for instance seem to benefit nicely from the anticipated formula that routinely delivers the entertaining goods for its avid core of fanboys. So why not wipe off the seemingly obscure and underrated **Doctor Strange** and provide the same kind of popcorn-pulsating mystique for blockbuster cinema?\r\n\r\n**Doctor Strange** started out as a comic book creation in 1963 by Steve Ditko and Stan Lee. Director Scott Derrickson (“Paradise Lost”, “The Exorcism of Emily Rose”, “Sinister”, “Deliver Us From Evil”) does an admirable job in giving shades of bizarre brilliance and magical manipulation to an unconventional Marvel comic book character hardly known for his capacity to translate his mystical mastery to celluloid with compelling curiosity. Derrickson, known primarily for his creative juices in the realm of horror fantasies, confidently serves up the off-kilter and hypnotic appeal of Dr. Stephen Strange as embodied by accomplished English actor Benedict Cumberbatch (“Black Mass”, “The Imitation Game”, “12 Years a Slave”). Interestingly, Derrickson and his handful of screenwriters craft **Doctor Strange** with a mind-blowing measurement of restraint and inquisitiveness. Indeed, **Doctor Strange** echoes its contemporary Marvel-established movies with predictable pluckiness to a certain extent but what is appreciated more is the uniqueness of the film’s ability to emphasize a cerebral superhero that is cut out of a different kind of creative cloth which feels quite distinctive from other brooding Marvel mavericks. Cumberbatch–mastering a rather effective American-accented sorcerer with skill–has injected a degree of inventive nobility and refinement that uplifts this calculating comic-book fantasy.\r\n\r\nCumberbatch’s egotistical Stephen Strange is an incredibly gifted neurosurgeon. His hands are truly miraculous tools of his medical trade and he takes pride in his abilities to treat the critical patients that have tremendous hope courtesy of his therapeutic capabilities. In a nutshell, Strange outshines his other surgical competitors because he is able to give to his patients on the operating table something other doctors cannot instantly muster up. However, cruel fate strikes its ugly head when Strange suffers the usage of his precious hands as a result of a horrific car wreck. The nerves in his hands are destroyed and the non-functioning of his limbs is an awful reminder that his surgical talents are something of the immediate past.\r\n\r\nAs Strange delves into self-pity and surfacing depression he cannot see just how supportive his fellow physician Christine Palmer (Rachel McAdam) is toward him. Clearly, Christine is in love with the alienating medical moper but Strange simply does not realize the extent of her affections because he is too busy sulking about his misfortune. The only factor that gets a promising rise out of Strange is his recent acknowledgement of the Tibetan community where there is a Kamar-Taj temple rumored to restore ailing body parts destined to make an individual “whole” and “complete” once again. Naturally, Strange wants to bypass the tedious and lengthy therapy sessions for a chance to experience the miracle of his once-amazing operating digits now ravaged by severe nerve damage.\r\n\r\nThe main source behind the Kamar-Taj temple’s heralded existence is The Ancient One (played by Tilda Swinton). She is instrumental in teaching the fundamentals of a selected Eastern mysticism that teaches the special concentration of healing the wounded and wasting human body when scientific medical practices fail to do so. Soon, Strange’s affiliation with The Ancient One and her mystical minions has more than a transfixing effect on gaining control of his ailing hands as he gains indescribable powers through the inner strength of mind and soul. Now, Dr. Strange can generate his own alternating state of philosophical wizardry that dictates shaping time and space dimensions. Strange’s out-of-body experiences supersede all his previous physical impairments as a force to be reckoned with at large. Whether observing Strange’s Cloak of Levitation methods or witnessing his supernatural prowess on the mean streets against wickedness Doctor Strange spins a wild and weird web of action-packed surrealism that is a welcomed addition to Marvel Comics’ showcasing of super-heroic protective cads feisty in flaws and frivolity.\r\n\r\nCumberbatch is mesmerizing as the self-absorbed genius Strange who perhaps is the best complex Marvel-related protagonist since Robert Downey Jr.’s flippant Tony Stark/Iron Man. The combination of heightened arrogance and high-brow self-doubt and vulnerability tactically works as Cumberbatch sells this portrayal solidly. Although Swinton’s The Ancient One is an intriguing enigma in her own right one must question why the absence of an Asian actor not considered for this particular role may have some scratching their heads in indignation? McAdam’s love interest Christine amounts to only being an afterthought not just in the eyes of her object of affection Strange but to the audience as well.\r\n\r\nThankfully, the other supporting players contribute marvelously to the festivities. Oscar nominee Chiwetel Ejiofor (Cumberbatch’s co-star from the Academy Award-winning “12 Years a Slave”) plays fellow sorcerer Mordo while Benedict Wong assumes the duty as another one of The Ancient One’s followers who guards the school’s sacred scriptures. Mads Mikkelsen is devilishly received as Kaecilius, the former disciple of The Ancient One gone rogue whose agenda in releasing an ominous demon Dormammu to the world will test the will of Doc Strange’s newfound mystical techniques and tactics.\r\n\r\nNo doubt that **Doctor Strange** is an impeccably surging superhero fable laced with stunning aesthetics and a richly robust score by Michael Giachinno. The high caliber of talent associated with this spry comic book actioner definitely ensures another superhero film franchise-in-the-making as Cumberbatch’s introspective doc administers his **Strange** dosage of Marvel movie-making medicine for the ages.\r\n\r\n**Doctor Strange** (2016)\r\n\r\nWalt Disney Pictures\r\n\r\n2 hrs. 10 mins.\r\n\r\nStarring: Benedict Cumberbatch, Tilda Swinton, Chiwetel Ejiofor, Mads Mikkelsen, Rachel McAdam, Benedict Wong, Benjamin Bratt\r\n\r\nDirected by: Scott Derrickson\r\n\r\nMPAA Rating: PG-13\r\n\r\nGenre: Science Fiction & Fantasy/Action & Adventures/Comic Book Fable\r\n\r\nCritic’s rating: *** 1/2 (out of 4 stars)\r\n\r\n(c) **Frank Ochieng** 2016",
        "url": "https://www.themoviedb.org/review/581e7bad9251410a0e01146e"
      },
      {
        "id": "582540379251417b2c0033e2",
        "author": "Gimly",
        "content": "Though the core events may not be anything new for the MCU, particularly in so far as its origin stories go (Stephen Strange's A-to-B is virtually identical to Tony Stark's in the first _Iron Man_ film) the psychedelic filter through which we experience these events is entirely fresh!\r\n\r\nNot all of the humour lands, and in fact sometimes actually detracts from the story. While the effects are very impressive from a conceptual angle, the graphical end-products do sometimes fall short. Benedict Cumberbatch is a fantastic actor, and does a fine job as Doctor Strange, virtually the whole cast are proven actors, but none are really given the chance to flex those acting muscles to any sort of a newly impressive degree.\r\n\r\nThose minor nitpicks aside, _Doctor Strange_ is another very successful entry to the MCU, just further proving that Marvel really know what they're doing in this latest form the film industry has taken.\r\n\r\n_Final rating:★★★½ - I strongly recommend you make the time._",
        "url": "https://www.themoviedb.org/review/582540379251417b2c0033e2"
      }
    ],
    "total_pages": 1,
    "total_results": 3
  }
]}




{ "stuff"[{"id":329865,"page":1,"results":[{"id":"584312a4925141676400049c","author":"Smashing UK Productions","content":"Prior to approaching this film, a word of warning that it is what many like to call a \"thinking person's sci-fi\". If you're going to watch this, I beg that you dedicate your utmost attention to it, as it is truly one rewarding experiences, one of the smartest, most well-constructed science fiction marvels of recent years. 'Arrival' is Villeneuve's magnum opus.\r\n\r\nFirstly, to put your mind at ease, I won't be analysing the plot, thus avoiding the use of spoilers. This decade, Villeneuve has crafted some fantastic works of art in the form of 'Prisoners', 'Sicario' and now this science fiction gem, and here's hoping his career further develops with more movie masterpieces coming our way. In a world where mysteries remain and the possibility of extraterrestrial life still stands unanswered, 'Arrival' approaches this with it's cliche-free take on the genre.\r\n\r\nThe relatively unknown Bradford Young provides the film with some of the most stunning cinematography ever conceived, taking advantage of the twilight hour to give the film its somewhat unique look, supported magnificently by Icelandic composer Jóhann Jóhannsson whose score is both haunting and beautiful. If you're someone looking for a science-fiction tale that keeps you guessing and thinking throughout, with fantastic performances, cinematography, music and near-flawless direction, then 'Arrival' is the film for you. The masterpiece of 2016!","url":"https:\/\/www.themoviedb.org\/review\/584312a4925141676400049c"}],"total_pages":1,"total_results":1}
{"id":284052,"page":1,"results":[{"id":"581bbdbbc3a36805c60001f1","author":"iheardthatmoviewas","content":"With each new Marvel film one could expect the studio to push the limits of what a superhero film should consist of. Films such as Captain America: Winter Solider, Guardians of the Galaxy and Ant-Man all consisted of elements that we have never seen within a superhero film before. Now, Marvel Studios attempts to push the envelop once more by leaving the world of high tech armors and super soldiers and entering the mystical world of magic. Leading this charge is Benedict Cumberbatch's Doctor Stephen Strange and hopefully he could answer why there is this strange mystical feeling that we have seen this all before.\r\n\r\n\r\n\r\n> From Marvel comes “Doctor Strange,” the story of world-famous neurosurgeon Dr. Stephen Strange whose life changes forever after a horrific car accident robs him of the use of his hands. When traditional medicine fails him, he is forced to look for healing, and hope, in an unlikely place—a mysterious enclave known as Kamar-Taj. He quickly learns that this is not just a center for healing but also the front line of a battle against unseen dark forces bent on destroying our reality. Before long Strange—armed with newly acquired magical powers—is forced to choose whether to return to his life of fortune and status or leave it all behind to defend the world as the most powerful sorcerer in existence.\r\n\r\nI am going to start off the review by discussing the only strong positive thing that came out of Doctor Strange and its by far the visuals. Beautiful vibrant colors pop at you throughout the film, the costume design is beyond extravagant and the framing is spot on. Doctor Strange and his fellow Sorcerers Supremes powers aren't fully on display until they enter the Mirror Dimension and my god, Tony Stark and Bruce Banner would hate this place. As they are men of science, they would hate that all rules of physics are thrown out the window as our Sorcerers Supremes are capable of breaking buildings apart and reforming to however they please. It is hard to not reference Inception but no one here is dreaming, these visuals are being created by the hand of mystical men and they use it to their power.\r\n\r\nIn all honestly, pushing the envelope when it comes to visuals was not a difficult task at all. Heck, if they didn't I would have been extremely disappointed as it was an obvious opportunity to take advantage of since we are dealing with magic. I am still extremely disappointed regardless as director Scott Derrickson completely missed another obvious opportunity to push the envelope this time in regards of character development.\r\n\r\nDoctor Stephen Strange is very much like a Tony Stark and other superheroes we have seen in films before as he is arrogant, egoistical and full of it. After Strange's accident in which he suffered extreme nerve damage to both hands, he dishes out every penny to his name to repair his hands in hopes he could continue his career as neurosurgeon. Every attempt fails and Strange becomes desperate enough to head to Nepal and finds himself under the guidance of Tilda Swinton's The Ancient One. Learning a whole new concept in the mystic arts forces Strange to reshape his way of thinking but Scott Derrickson does not let this have Strange reshape who he is as a person as well.\r\n\r\nDoctor Strange should have found himself being more like a Steve Rogers towards the end of the film as learning the mystic arts and his accident alone should have broken his ego. But instead everything still comes easy to him as he masters magic with ease with very little tension. He has a couple hiccups in the beginning but once The Ancient One puts him under her wing it is smooth sailing and Strange is stealing texts, wielding powerful weapons and defeating Supremes with decades of training with ease.\r\n\r\nYou cannot say that Strange was destined for the mystic arts and that is why everything came so easy for him.
{"id":324668,"page":1,"results":[{"id":"579cf601925141066e000c65","author":"Screen Zealots","content":"A SCREEN ZEALOTS REVIEW www.screenzealots.com\r\n\r\n**LOUISA SAYS:**\r\n\r\n“Jason Bourne” is a spy movie for imbeciles. The entire film feels like it’s written using nothing more than the vocabulary of a 12 year old and consists of two very tiring hours of repetition. Bourne gets chased, throws some punches, and gets away. Shoot, bleed, run, escape. Shoot, bleed, run, escape. Shoot, bleed, run, escape. Repeat to infinity.\r\n\r\nI actually felt bad for the actors having to deliver such dreadful dialogue; their onscreen characters literally describe everything that’s happening as it unfolds (“It’s Bourne!” and “I’m going to shoot!” and “He’s running upstairs!” and “The files are downloaded!”). At some point it started to get funny.\r\n\r\nMatt Damon is back as Jason Bourne and it feels like he’s sleepwalking through the entire movie. Even the talented Alicia Vikander phones in her questionable performance (is she supposed to have an accent or not?) and Tommy Lee Jones plays yet another scowling caricature of a sinister government official. There’s little in the way of character development and the only actor who’s enjoyable here is franchise veteran Julia Stiles. What a pity that she’s not given much to do.\r\n\r\nEven the action sequences are inexcusably incoherent. Paul Greengrass is one of my least favorite directors, mainly because he loves that fast cutting junk where I can’t tell what is going on in the movie. It’s a filmmaking style for those with short attention spans and it’s a sign of extreme laziness.\r\n\r\nGreengrass sucks all the fun out of what should’ve been a spectacular car chase down the Las Vegas strip. Instead of taking his time and showing off the pageantry of stunt driving with a steady hand (see the legendary cinematic car chases in Quentin Tarantino’s “Death Proof,” William Friedkin’s “The French Connection,” Peter Yates’ “Bullit,” Justin Lin’s “Fast Five,” or hell, even Michael Bay’s “Bad Boys II“), Greengrass once again opts for the lazy way out and gives us a messy commotion of three second snippets that seem to be edited together in a blender on the high setting.\r\n\r\nNone of the elements work: the film covers no new ground, it lacks any energy, and it simply feels tired, making “Jason Bourne” the lamest of all in the series.\r\n\r\n**MATT SAYS:**\r\n\r\n“Conversation” with 5-word sentences using spy and techno-jargon. Quick cut to person typing on computer: Beep, boop, beep. Quick cut to shaky cam conversation. Another five-word-sentence conversation and more shaky cam. Cut to shaky-cam motorcycle chase with no sense of geography. Cut back to computer.\r\n\r\nCut, cut, cut. Shaky cam, shaky cam, shaky cam. “Jason Bourne” might as well have been shot and assembled by a seven-year-old with ADD that hasn’t taken his Ritalin. It wasn’t so much edited as jammed together. So little artistry went into making this movie that it’s hard to even call Paul Greengrass its “director.”\r\n\r\nOne of my recurring rants is on the use of quick cutting and shaky cams in action films: it’s the hallmark of lazy filmmaking. When your action sequences are constructed by using cut after cut after cut, you don’t have to worry about storyboarding (contrast “The Raid: Redemption“). You don’t need actors who have any training in fight choreography (contrast “The Raid 2“). You don’t have to concern yourself with geography or spatial relationships. In other words, instead of having to WORK at creating a compelling action sequence, you can hack your way through it. And boy, there is NO ONE working in film now that loves hack action better than Paul Greengrass. And nowhere has Greengrass’s hackiness been on display more than in “Jason Bourne.” It’s his masterpiece of hacketry. I can continue making up new word forms using “hack” t
{"id":262500,"page":1,"results":[{"id":"55e003efc3a36826a40016c9","author":"Per Gunnar Jonsson","content":"As I did in my review of the first instalment, in this movie series I should probably point out that I have not read the books. Some people claim that this movie do not follow the books but, obviously, I cannot comment on that. So my review is based on the movie and the movie alone. I have to confess that I mostly watched this movie because I did watch the first instalment and felt obliged to see where the story went.\r\n\r\nThis movie have quite a few fairly cool special effects, especially the ones when Tris is in the virtual reality world trying to open the cube with the message to the inhabitants in the closed up city. Unfortunately this pretty much sums up the good parts of the movie.\r\n\r\nAs with Divergent I found this movie to be fairly mediocre. One reviewer said that this was a movie dumbed down for the teenage audience. Unfortunately I feel that he was right. Also unfortunately I think many teenagers are a lot smarter than Hollywood believe they are.\r\n\r\nThe plot is, well, mediocre. The acting is fairly meh. The main character, Tris, really lacks any form of charisma and spends most of the movie going around in some state of melancholy feeling sorry for herself and everything that happens around her. Apart from Four most of the people were behaving immaturely, cluelessly, froze up or panicked whenever something nasty happened and switched allegiances back and forth like you changed shirts.\r\n\r\nWhen Tris finally opened the cube I was expecting something cool and unexpected. What we got was a rather dull message about the city and its “purpose”. I complained in my review of divergent that we got absolutely no background information as to how the people had ended up in this ridiculous situation with a closed city and these factions that I still do not understand what they were supposed to solve. The message was supposed to explain this but it explained absolutely nothing except that the divergents were some kind of purpose or solution.\r\n\r\nThe ending? Well again this is a book series so it is not surprising that it ends in somewhat of a cliffhanger but it was really a cheap ending, one that you would expect from a TV series episode.\r\n\r\nSo I cannot say that I liked the movie very much. The virtual reality special effects scenes were fairly cool but that was about it.","url":"https:\/\/www.themoviedb.org\/review\/55e003efc3a36826a40016c9"},{"id":"5709098b92514147fc000dca","author":"Andres Gomez","content":"Briefing; this movie is just bad.\r\n\r\nThe first was not good either but this one continues the path open by the first. The special effects are quite noticeably rendered by computers and the actors are uncharismatic, other than that, the plot is just bad.\r\n\r\nAnother movie with quasi-teenager lead roles in a dystopic future in which stupidity is spread all along man-kind.\r\n\r\nWe just witness the struggle of our heroine with her self-imposed guilt with stupid enemies that let her survive at every moment so she can become the messiah she is meant to be.\r\n\r\nI think the only positive part I can get from this movie is the preeminence of strong and important female characters. Other than that, just skip it.","url":"https:\/\/www.themoviedb.org\/review\/5709098b92514147fc000dca"},{"id":"5787bc1792514131c0000c5a","author":"Reno","content":"> The mystery box and the power hungry leaders!\r\n\r\nThis is not a bad sequel, I quite enjoyed it, but I think I liked 'Divergent' better. The story continued a very short after where it ended in the first. In this part, it was all about power hungry where many try to get that top post. On the other side, there will be an attempt to open a mystery box that found which might reveal some important detail about them.\r\n\r\nLooked like a very good storyline, unpredictable stuffs, but not utilised to its full potential. Though the actors were good, especially Shailene was sexy in her shor
{"id":76341,"page":1,"results":[{"id":"55660928c3a3687ad7001db1","author":"Phileas Fogg","content":"Fabulous action movie. Lots of interesting characters. They don't make many movies like this. The whole movie from start to finish was entertaining I'm looking forward to seeing it again. I definitely recommend seeing it.","url":"https:\/\/www.themoviedb.org\/review\/55660928c3a3687ad7001db1"},{"id":"55732a53925141456e000639","author":"Andres Gomez","content":"Good action movie with a decent script for the genre. The photography is really good too but, in the end, it is quite repeating itself from beginning to end and the stormy OST is exhausting.","url":"https:\/\/www.themoviedb.org\/review\/55732a53925141456e000639"},{"id":"55edd26792514106d600e380","author":"extoix","content":"Awesome movie!  WITNESS ME will stick with me forever!","url":"https:\/\/www.themoviedb.org\/review\/55edd26792514106d600e380"},{"id":"5654a732c3a368176600023d","author":"Cineport","content":"Fantastic action that makes up for some plot holes.","url":"https:\/\/www.themoviedb.org\/review\/5654a732c3a368176600023d"},{"id":"57162d35c3a3682f450038b2","author":"balumahendran","content":"Wonderful action movie. Scenes are unimaginable. Lots of graphics used in this movie. This is totally a very good action movie.","url":"https:\/\/www.themoviedb.org\/review\/57162d35c3a3682f450038b2"}],"total_pages":1,"total_results":5}
{"id":271110,"page":1,"results":[{"id":"572d7bc1c3a3680fdb001d69","author":"Frank Ochieng","content":"Well another super-sized Marvel Comics superhero saga hits the big screen with the selected savior Captain America taking the top billing on the marquee. Thus, the pulsating popcorn pleaser **Captain America: Civil War** arrives on the scene to giddy audiences that have been loyal and fixated on the successful spring of mighty Marvel heroes that have been paraded to viewers throughout the last few years. Thankfully, **Captain America: Civil War** carries on the tradition of spry superhero-studded spectacles that have been glorious and adventurous from the stable of Marvel-based movies guaranteed to win over the enthusiastic hearts of avid comic book fanboys everywhere. Joyously overstuffed and convincingly extensive with a super team armed with crime-fighting excess, **Civil War** seizes the moment to introduce a noteworthy twist: two factions of rescuing superpowers engaging in some explosive in-house fighting led by two of Marvel Comics main standouts in Chris Evans’s Captain America and Robert Downey Jr.’s Iron Man.\r\n\r\nCo-directors Anthony Russo and Rene Russo were instinctively crafty to link the overly successful Iron Man film franchise to the **Captain America: Civil War** inner circle to ensure an even more treasured toxic atmosphere. Superhero fans will get a thrill of witnessing the extra add-ons concerning other dynamic titans to join the action-packed festivities involving Team Captain America versus Team Iron Man. True, **Civil War** has its share of flaws but that does not take away from this heroes-in-crisis flick demonstrating its ambitious overtones.\r\n\r\nSo what has caused the bad blood among the great and grand good guys known for protecting the world from evil dominance and destruction? Essentially the theme of collateral damage, the involvement regarding civilian-related deaths and injuries plus the world-wide backlash has created a controversy pitted against The Avengers. Specifically, Captain America (a.k.a. Steve Rogers) and Scarlet Witch\/Wanda Maximoff (Elizabeth Olsen)  are responsible for the boisterous battle that caused such negative sensation resulting in political turmoil. Avengers head honcho Iron Man (a.k.a. Tony Stark) is dealing with his own personal regrets in the ill-advised creation of the unpredictable Ultron. The political authority want to hold Iron Man, second-in-command Captain America and the rest of the Avengers accountable for the global devastation that have taking its toll when trying to oversee the potential harm wreaking havoc on humanity.\r\n\r\nLeading the charge in putting a watchful eye on the labeled reckless Avengers is Secretary of State Thaddeus Ross (William Hurt) that suggests the super group be monitored by the United Nations. Naturally friction develops between the superheroes that either agree with Ross’s UN restriction policies or disagree with being placed under a microscope that threatens to handcuff their free-wheeling heroic duties. All these contrasting beliefs eventually turn into epic back-and-forth confrontations where the raging Avengers are at odds with each other.\r\n\r\nFor Stark\/Iron Man’s stance, he is willing to toe the line and ultimately agree that his crew needs to tone down their tenacious tactics as crime-stoppers. Iron Man’s consciousness, particularly in the case of a disillusioned mother (Alfre Woodward) making him feel guilt-ridden over her son’s death during an intense Battle of Sokovia, is probably the main factor behind his decision to have his team reigned in a bit from the political watchdogs. Siding with Iron Man’s viewpoint are the likes of Black Widow (Scarlett Johansson), Vision (Paul Bettany) and War Machine (Don Cheadle). As for Rogers\/Captain America, he is not too thrilled being put in check by the intrusive governmental pencil-pushers that want to scrutinize the team’s every move. Standing with Captain America firmly are Falcon (Ant
{"id":267935,"page":1,"results":[{"id":"573800a8c3a36864be00071b","author":"Screen-Space","content":"\"The only element of the entire production that inspires any kind of wonder is just how far from a satisfying adaptation the film proves to be...\"\r\n\r\nRead the full review here: http:\/\/screen-space.squarespace.com\/reviews\/2016\/5\/15\/the-bfg.html","url":"https:\/\/www.themoviedb.org\/review\/573800a8c3a36864be00071b"}],"total_pages":1,"total_results":1}
{"id":207932,"page":1,"results":[],"total_pages":0,"total_results":0}
{"id":188927,"page":1,"results":[{"id":"57932005c3a368636b006bd1","author":"Frank Ochieng","content":"Some diehard **Star Trek** fans may not necessarily feel that the Justin Lin-directed third installment of this science fiction\/space saga film franchise “boldly goes where no man has gone before” creatively. Surprisingly, Lin (director of two “Fast & Furious” flicks) shows some engaging and intriguing heft in **Star Trek Beyond** as the adventurous exploits of the USS Enterprise crew are likely to stir the collective pot where the nostalgic sentiments of the Star Trek brand from yesteryear bridges the gap to the current cinematic explosiveness of modern-day Captain Kirk and company. Although it is extremely difficult to immediately dismiss filmmaker J.J. Abrams’s resourceful fingerprints concerning the imaginative **Star Trek** (2009) and the thoroughly enjoyable **Star Trek Into Darkness** (2013) he graciously steps aside to allow Lin’s energizing directorial vision to further explore Trek mythology on the big screen.\r\n\r\nEssentially, **Star Trek Beyond** is a vibrant cosmic canvas that is expansive in its boundaries of exploration. Visually arresting, well-paced and armed with compelling story-telling and a healthy dosage of curiosity and mystery, Lin manages to stay true to the traditional Trek-oriented universe by incorporating rousing special effects and offering a galactic grandeur of planetary peculiarities and exotic alien races to stimulate the exquisite narrative. Screenwriters Doug Jung and Simon Pegg (Star Trek’s on-screen character Montgomery “Scotty” Scott) incorporate an eye-opening mixture of dramatic edginess, off-the-cuff humor and the cohesive rapport among the cast-mates that have inherited the iconic Star Trek personalities and made these familiar faces from the classic 60’s TV show and previous non-reboot films a revelation in the millennium age of blockbuster sci-fi action adventure.\r\n\r\nThe plot channels in a sense of challenging malaise for the USS Enterprise’s top officers in Captain Kirk (Chris Pine) and Commander Spock (Zachary Quinto). What seemingly spices things up regarding the deja vu space journeys aboard the spacecraft is the questionable and powerful device that Kirk and his crew are babysitting. This powerful tool of destruction is capable of destroying humanity as we know it. In particular, the opportunistic Krall (Idris Elba) is the lizard-looking culprit determined to get his diabolical hands on the corrosive contraption. Naturally, Krall and his menacing minions must subdue Kirk and his crew to achieve success in having this ominous object in his deadly grasp. Krall’s willingness to cripple the USS Enterprise proved to be an ambitious mission fully accomplished. For Kirk and his group the results were disheartening as Krall’s forceful attacks rendered the ship disabled as it crashed on the desolate planet of Altamid. Thus, Kirk and his charges are stranded on his rocky haven with no hope in sight. The harsh reality for the vulnerable USS Enterprise visitors, besides being divided and scattered in all directions on this problematic planet, involved getting into survival mode as the hostile reptilian creatures surrounded them at will.\r\n\r\nThe aforementioned split of Kirk and his exposed cohorts called for a series of various crisis carried on at different, chaotic spots. Kirk and Russian crew member Pavel Chekov (played by the late Anton Yelchin) were primarily tasked with trying to rescue their colleagues from the claws of Krall and his cronies. Elsewhere, Dr. Bones (Keith Urban) tries to patch up the injured Spock following the aftermath of the ship’s wrecking. Pegg’s Scotty and womanly warrior in alien Jayla (Sofia Boutella) make the valiant effort in trying to reach Kirk in the middle of total ribaldry.\r\n\r\n**Star Trek Beyond** has stylized flash and Lin ensures that his pulsating production stays faithful to the Trek legacy. Sure, **Beyond** is not anything innovative o
{"id":294272,"page":1,"results":[{"id":"57ae94b0c3a36872780008a2","author":"Frank Ochieng","content":"The infectiously whimsy and adventurous **Pete’s Dragon** undergoes a polished millennial-style rebirth for today’s kiddies not fortunate enough to be alive when the 1977 live-action animated musical blueprint made its charming, impressionable impact for youngsters of all ages back in the day. The festive and frolicking Disney flourishes are applied to co-writer\/director David Lowery’s re-imagination of an impish boy and his devoted dragon. There is an even balance of refreshing nostalgia and modern-day spryness and magical sentiment that hovers over this engaging family fable remake from the polyester period. Lowery (2013’s “Ain’t Them Bodies Saints”) and screenwriters Toby Halbrooks and Malcolm Marmorstein pack some vibrant punch of wonderment into this children’s tale of gentle mischievousness. Sure, the simplistic approach to the storytelling feels like a step-by-step progression experienced in a majority of child-friendly escapist entertainment. Still, **Pete’s Dragon** is steady in its gentle precision for homespun high jinks. \r\n\r\nWhether appreciating this Disney classic from four decades ago or relishing in Lowery’s current contemplative spectacle one will agree that the heart and soul of this sweet and uplifting narrative remains true to the main factors involved: the runaway (now orphaned) boy Pete and his trusty creature companion Elliot. In fact, it is just as instrumental that the adult presence in **Pete’s Dragon** make an impacting impression as well because this exposition should cater to the delicate sensibilities in us all whether as a curious tyke or reflective grown-up.\r\n\r\nOrphaned and alone, 10-year old Pete (Oakes Fegley) had become a wild child in the deep woods. What was looking pretty grim for Pete in terms of loneliness, abandonment and despair was soon cured when he ended up befriending a giant green furry high-flying dragon named Elliot. For the most part the imposing Elliot served as Pete’s surrogate parent while ensuring protection and friendship for the parent-less prepubescent. There is no question about the dependency that Pete and his dragon Elliot share in loving dependency. The scenic wooded haven serves as the treasured playground for the playful, nature-loving tandem.\r\n\r\nEnter the father-daughter duo of Mr. Meacham (Robert Redford) and Grace (Bryce Dallas Howard). Both strangely have an eerie connection to Pete’s and Elliot’s existence without realizing it. Meacham had been telling engagingly colorful stories to the local children about a mysterious dragon existing in the Northwest Pacific woods. As for Grace she happens to be employed as a Park Ranger for the site of the mentioned woods her father constantly references in his repetitive stories. Soon Grace will encounter the disheveled Pete who is more than willing to share his adventures of living in the thick woods with his massive dragon buddy Elliot. This all seems rather intriguing to Grace because Pete’s description of Elliot is curiously similar to the fictional monster that Meacham cites to the spellbound youngsters. Whatever the case may be regarding Pete and his personalized plight this is something that Grace must investigate.\r\n\r\nGrace is not the only one who finds the wandering Jungle Book youthful clone intriguing. Both Grace’s fiance Jack (Wes Bentley) and 11-year old Natalie (Oona Laurence from “Southpaw”) are in awe of Pete as well. In any event, Grace and Natalie are determined to find out what lies beneath the surface with the boy and his behemoth sidekick dragon that recalls Meacham’s exaggerated tall tales.\r\n\r\n**Pete’s Dragon** dutifully follows what amounts to be the on-going formula for escapist children’s storybook gems as recently told on the big screen. The reliable source of pathos and warmth wisdom stems from a vulnerable child in search of belonging especially when trying to loca
{"id":157336,"page":1,"results":[{"id":"5463856c0e0a267815002598","author":"Reno","content":"Well, one off from two of this year's most expected movies alongside 'The Battle of Five Armies'. Like all the Chris Nolan fans, I was equally excited to see the movie on the opening day opening show. But I slightly disappointed that it was not a digital 3D film. I agree, this science-fiction was more dramatized than usual space travel stories does with an adventure-thriller. Almost a 3 hour long stretch movie did not waste much time to take us to the core of the story. Get prepared for this extremely rare voyage into the space with a logical explanation for everything you see on the screen. Well done research for the most matured and intelligent writing. All the credit must go to Nolan brothers. A good sign from Jonathan Nolan, who can make big in the entertainment industry in a future like his brother.\r\n\r\nAs we know many had liked 'Inception', to me that was a simple multi-layered action movie, that's all. But the same stuffs that used in this film makes sense. In fact, you have to have a little knowledge over how the universe works, so then it will be easy to catch the scene and situations while watching the movie. Totally like a documentary style concept, but with the additional stuffs like characters and its emotions add flavor that gives a movie look. An educational movie, though it also can work for those who wants just entertainment. Only the slow movie pace would test their patience.\r\n\r\nIt all begins like Shyamalan's 'Signs' movie with a family living surrounded by corn field. Then switches to 'The Astronaut Farmer' and going through 'Gravity', finally meets the 'Inception'. It was just a reference to call the movie setting that brings constant change for every half an hour. Like the opening scene and the end scene had over a 100 years difference.\r\n\r\nAs I earlier said it was the story of a family alongside the future of humankind and decoding universal mysteries through travelling in space and time. This movie would a reasonable for those who thought '2001: A Space Odyssey' is a boring piece, Cleverly written cinematic piece especially for science geeks. I don't know how perfect the movie to the actual present astrophysics, but will justify for the common people's capacity of understanding with an encourageable amount of commercial elements in it to entertain as well.\r\n\r\nThe first three quarters of the movie was well made. It puts me in a unblinkable position like a story was narrated by Brian Cox in a television series. Like I said, lots of astrophysics involved in it, but strangely human emotions were also exhibited equally that I never expected one from Nolan film. It was not an ordinary sentiment, but was strong enough to make a man cry for happy and sad situations in the movie. I liked science and emotion coming together. In fact, it saved the movie, otherwise it would have been a science documentary straight from NASA production through Nolan direction.\r\n\r\nThere are many surprise elements in the movie and of course there is a twist at the end. We can call it a series of twists like the layers. Compared to last quarter of the movie to the rest, it completely detaches which opens broadly to the different directions. And that happens so fast rushing towards the other end. Which give an impression of the movie 'Inception'. In a perfect way to say the first 75% was 'The Tree of Life' and the remains are 'Inception'.\r\n\r\n‘‘This world's a treasure,\r\nbut it's been telling us to leave for a while now.’’\r\n\r\nAll the actors were so good. Matthew McConaughey steals the show as he dominates the majority of the screen space in the story presentation. There's no ruling out the fine performance executions from Anne Hathaway and the young star from the Twilight movie, Mackenzie Foy. The remaining cast was having less scope which were like the guest appearances that was widened a little broader, but was perfectly fitted for the stor
{"id":328111,"page":1,"results":[{"id":"579cfaac9251411b36008316","author":"Screen Zealots","content":"A SCREEN ZEALOTS REVIEW www.screenzealots.com\r\n\r\nAnyone who is fortunate enough to share their life with a companion animal will undoubtedly get a kick out of the latest Illumination animated effort, “The Secret Life of Pets.” The film soars when it focuses on animals interacting with their human guardians, with the canine and feline characters acting like real pets do (if my cats could talk, I’m sure they’d converse in  similar dialogue as portrayed onscreen). The first part of the movie is incredibly perceptive and clever, as is the last 10 minutes because it zeroes in on these very relationships (the opening and closing scenes of the movie are touching and have lots of heart). The problem comes in the middle when the story stops being about ‘pets being pets.’ Sadly, the majority of the film lags when it ventures into the dreaded animated movie territory of sheer stupidity.\r\n\r\nLoveable human Katie (Ellie Kemper) and her pup Max (Louis C.K.) are the best of friends. Max has several animal buddies that live in the same New York City high rise, including dogs, cats, birds and guinea pigs that stop by for daily visits. When Katie brings home Duke (Eric Stonestreet) from the animal shelter, Max devises a plan to get rid of him. Problem is, the two dogs find themselves lost in the big city and Max’s would-be girlfriend Gidget (Jenny Slate) takes it upon herself to recruit other pets — including the elderly paralyzed basset hound Pops (Dana Carvey) and lonely falcon Tiberius (Albert Brooks) — to bring Max home. Along the way they find themselves at odds with the anarchist gang of “flushed pets,” a group of outspoken, anti-human animals led by former magician’s bunny Snowball (Kevin Hart).\r\n\r\nThe voice acting runs the gamut from phenomenally good (Slate) to wince inducing (Hart). Slate is perfectly cast as Gidget, a poufy white spoiled little dog who eventually saves the day. She proves herself tenfold as a legitimate voiceover actor, and I hope to see her get more work in animation in the future. There’s no denying that Hart is a super likeable actor, but his portrayal of Snowball the bunny is nothing more than repeated, strained yelling. His overall performance felt so labored and unnatural that listening to him onscreen actually made me uncomfortable. I will not hesitate to nominate Hart for a Razzie award for worst actor of the year because his voice work is that bad.\r\n\r\nIn the ‘oh no, not again’ category, there’s plenty of dopey, brainless scenarios crammed in with a feeling that their sole existence is to appease young kids. We get yet another ridiculous animal driving a car stunt that we had to endure in this summer’s nearly insufferable “Finding Dory.” In fact, in “The Secret Life of Pets” we get not only a rabbit driving a van but also a lizard driving a bus and a pig driving a taxi.\r\n\r\nThe absurdity isn’t the only problem: it’s the repetition. The filmmakers must’ve run out of good ideas and instead of moving the story forward, the audience gets the same monotony over and over and over again. I don’t require my animated films to be completely based in reality (there’s a particularly amusing Busby Berkeley inspired musical sequence in a sausage factory), but I do expect more originality than is delivered in this movie. The story at times takes a cynical approach in several places and some of the themes may be too much for sensitive kids (but the film provides a great starting point for a learning opportunity about pets and how animals shouldn’t be viewed as disposable).\r\n\r\nAt least the animation is commendable, nice and colorful with lively, fully realized backgrounds. It’s visually interesting enough for adults and fans of the genre but it’s also vibrant and bustling enough to keep the kids interested. There’s a lovely original score with a lighthearted, almost vintage
{"id":43074,"page":1,"results":[{"id":"57846b3792514121bd003696","author":"Screen-Space","content":"\"While it falls short of nailing the anarchic spirit and character chemistry of Ivan Reitman’s beloved 1984 blockbuster, Feig and his cast of game comediennes deliver enough thrills and giggles to both justify the long-in-development franchise-starter and smother the internet’s white noise of negativity...\"\r\n\r\nRead the full review here: http:\/\/screen-space.squarespace.com\/reviews\/2016\/7\/12\/ghostbusters.html","url":"https:\/\/www.themoviedb.org\/review\/57846b3792514121bd003696"},{"id":"5789be5892514163c4000747","author":"Frank Ochieng","content":"Filmmaker Paul Feig's **Ghostbusters** reboot pretty much followed the characteristic aspects of his previous films (\"Bridesmaids\", \"The Heat\", \"Spy\") all incorporating a self-awareness of female-oriented friendship and the estrogen-driven escapades rooted in inspired goofiness. So given this familiar foundation of Feig's big screen blueprint one would expect that his creative input into the continued Ghostbusters franchise for the millennium moviegoers would result in the heralded hype his film project is now enjoying at large. Sure, the feminine-charged **Ghostbusters** seemed like a radical concept and would obviously trigger the nostalgic sentiments (and comparisons) of the classic 80's comedy spearheaded by beloved on-screen paranormal hucksters Bill Murray, Dan Aykroyd, Harold Ramis and Ernie Hudson. Nevertheless, singer Ray Parker Jr.'s lyrical catchphrase \"Who you gonna call?\" within the Ghostbusters theme song needs to be addressed accordingly. The answer: the handlers behind the original **Ghostbusters** film that could uplift the disjointed high jinks and synthetic silliness of Feig's current comedic ghostly she-power schlockfest.\r\n\r\nIt is only natural that **Ghostbusters** had high expectations for Sony Pictures to perform well given the aggressive marketing tactics, early release of the Ghostbusters movie trailer (which was heavily panned online) and the aforementioned cinematic legacy of the original film's fanatical following and reputation. However, this third installation of **Ghostbusters** feels curiously flat and strained in its stillborn witticism. The creep factor borders on campy and cheesy (although this effectively worked for Ivan Reitman's 32-year old spook-ridden farce in the eighties) for which in today's cinematic circle is inexcusable due to the edgier and challenging special effects that could have played up the whimsy and wonderment of this breezy, bubble-gum colored romp with seemingly low-grade spark and sizzle.\r\n\r\nFeig's interpretation of the **Ghostbusters** universe could have been fresh and favorable especially with the colorful casting of his capable four female principals in the Emmy-winning and Oscar-nominated Melissa McCarthy along with Saturday Night Live personalities Kristen Wiig, Kate McKinnon and Leslie Jones. Unfortunately for these noted funny ladies they were saddled (or slimmed if you will) by a transparent script almost as invisible as the pesky ghosts they are trying to pacify. The recycled by-the-numbers hilarity and hysteria does not make this brand of ghost-busting quite distinguishing. Chemistry-wise, the Ghostbuster gals seem to revel in the collective merry-minded mischievousness and genuinely try to bring energy and outrageous antics to this flaccid frightfest. Still, the mixture of Ghostbusters' gooey gumption with a dash of egghead feisty femininity never seems to translate into anything beyond the tired gimmick of promoting another excuse to tap into yesteryear's profitable fun and frolic that made the wise-cracking Murray and his klutzy cohorts so amusing and welcomed in their rollicking ghostly gem from the Reagan-era.\r\n\r\nQuite frankly the notion that **Ghostbusters** is unfairly being knocked for its misogynistic overtones fueled by bias Internet-based fanboys not accepting that nerdy womanly scientists cannot fill
{"id":127380,"page":1,"results":[{"id":"5835dce5c3a3682fad019c4a","author":"Reno","content":"**Before Nemo, a long ago another child got lost in the open ocean...**\r\n\r\nWhoa! 200 million dollar film, 1 billion box office collections worldwide. The 27th film to do that so and the 5th animation film. This sequel was made after 13 years, surely a long gab, but 'Finding Nemo' was one of my favourite animations, tell me who does not love it those who love animation. Nevertheless, I liked the idea of having a sequel, but I scared it would go to flop terribly. Now, after watching this, I totally stunned. This is not a greatest animation ever made, but the way the screenplay handled, along with other stuffs, this makes one of the best among its kind.\r\n\r\nFirstly, when I heard the sequel's title, it made me laugh. Like, whaaaat? Once again the story is going to repeat. I did not think it would bring a big change. Actually, it was a different tale, especially I was not expecting it to be emotional. Tell me how many tearjerker-animation you have seen. Once again the Disney-Pixar jointly did it. I think appreciation must go to the director who also made the original film. Great casting too, I mean the voice- over artists.\r\n\r\nWe know that Dory is severely suffering from the short term remembory (memory) loss. Now this tale is going to reveal her backstory. From her childhood to till she meets Marlin and then Nemo, there was a series of forgotten events. She slowly regains some of those memories and begins her quest to find out more. This is where she gets lost, but the title defines that she was lost before and now looking a way to get back where she really belongs.\r\n\r\nFor me, after 'Frozen', this film is what emotionally got me. The value of having family and friends beautifully disclosed. It might be an animation, but still a meaningful story from many perspectives. Lots of new characters were introduced and those were really cool ones. I expect theirs short animations to make its way about their origins, particularly Hank the octopus and his story about how he lost one of his tentacles.\r\n\r\nThe Oscars is the quarter of a year away, but releasing nominees would come weeks ahead. So it's about time to learn where this one fit in. But I'm anticipating close contest between this, 'Zootopia' and 'Red Turtle'. Coming back to the review, this is a good watch, for everybody, so I highly recommend it. I hope there will be a third film, but like I had felt before this, I desire it and then I'm not sure it would extend its legacy to further. So fingers crossed!\r\n\r\n_9\/10_","url":"https:\/\/www.themoviedb.org\/review\/5835dce5c3a3682fad019c4a"}],"total_pages":1,"total_results":1}
{"id":277,"page":1,"results":[],"total_pages":0,"total_results":0}
{"id":135397,"page":1,"results":[{"id":"55910381c3a36807f900065d","author":"jonlikesmoviesthatdontsuck","content":"I was a huge fan of the original 3 movies, they were out when I was younger, and I grew up loving dinosaurs because of them. This movie was awesome, and I think it can stand as a testimonial piece towards the capabilities that Christopher Pratt has. He nailed it. The graphics were awesome, the supporting cast did great and the t rex saved the child in me. 10\\5 stars, four thumbs up, and I hope that star wars episode VII doesn't disappoint,","url":"https:\/\/www.themoviedb.org\/review\/55910381c3a36807f900065d"},{"id":"559238f89251415df80000aa","author":"Ganesan","content":"Overall action packed movie... But there should be more puzzles in the climax... But I really love the movie.... Excellent...","url":"https:\/\/www.themoviedb.org\/review\/559238f89251415df80000aa"},{"id":"5639d6cd9251416d5201312c","author":"redTed","content":"I've never been a fan of this series. The only impressive thing of the original was the graphics that were, at the time, breathtaking. But we all know great graphics alone can't save a film. \r\nI watched this new effort just to see how far CGI has come in the time since the original and I can safely say, not very far. From the opening scene with the terrible looking and poorly animated bird, it's obvious that CGI has reached its limits in recreating realistic content. \r\nAs for the film. The dreadful script and annoying characters helped me lose any interest after about 15 mins. Ok for the age range it's aimed at I suppose, but there are far better films out there worthy of your money.","url":"https:\/\/www.themoviedb.org\/review\/5639d6cd9251416d5201312c"},{"id":"56544b11c3a36850fa003fcc","author":"John Chard","content":"Untamable Devil.\r\n\r\nOne thing that would be 100% guaranteed prior to the release of Jurassic World, is that whatever the quality, or lack of, the notices would be mixed. Thus the reactions would be akin to those that Indiana Jones 4 received, charges of ruining childhoods and franchises etc.\r\n\r\nJurassic World does exactly what is expected of it, it's a popcorn blockbuster that plays out as mindless fun, complete with outstanding effects, monster mayhem and moments of dumbness. In fact it's very much a safe sequel, reverting to the original formula without the classy edges of Spielberg's deft touch.\r\n\r\nThere's a likable cast fronting up the pic, with Chris Pratt as the hero carrying some olde adventure chops about him, and Bryce Dallas Howard (her natural beauty sparkling on Blu-ray) a fun femme side-kick. The writers introduce a couple of new mighty monsters to the series, hell of beasties for sure, while the photography, stunt work and musical score all impress greatly.\r\n\r\nThe Velociraptor plot line is crummy and daft, almost as daft as Bryce's high heels character arc, and the familiarity factor does grate a little at times, but it's a rollicking good time not to be taken remotely seriously like it's some sort of series disgrace. 7\/10 ","url":"https:\/\/www.themoviedb.org\/review\/56544b11c3a36850fa003fcc"},{"id":"56daade3c3a3684cae001628","author":"kendsley2003@yahoo.com","content":"All in all this movie brought back the franchise that started out and captured the worlds attention. From the T-Rex chasing them down the road in there jeep to the velociraptors stalking them and picking them off one by one. \r\n\r\nJurassic World brought the franchise back to the state of reality. (If dinosaurs were real, this would be the set up for a park and containment of dinosaurs).\r\n\r\nChris Pratt did a great job on not only playing his part but looking it as well. Mis. Howard did ok. It seemed like she stumbled through most of her scenes and didn't bring key emotional expressions or reactions to the scene moments. But with her OCD and control issues played up against Mr. Pratt it brought the key relationship to tie the movie together. \r\n\r\nThis is a must see movie!","url":"https:\/\/www
{"id":131631,"page":1,"results":[{"id":"547e6075c3a368256200022f","author":"anthonypagan1975","content":"It was good. Although I wish it had more action scenes. It's worth watching ago don't miss out!","url":"https:\/\/www.themoviedb.org\/review\/547e6075c3a368256200022f"},{"id":"54d9b29c9251410a4500100a","author":"Andres Gomez","content":"Yet more of the same extended in an inexcusable way. Let's hope the last movie of the saga can get a proper end.","url":"https:\/\/www.themoviedb.org\/review\/54d9b29c9251410a4500100a"}],"total_pages":1,"total_results":2}
{"id":47933,"page":1,"results":[{"id":"5769f7afc3a3683726001772","author":"Screen-Space","content":"\"Independence Day: Resurgence entertains like few Hollywood blockbusters have of late, largely by foregoing pretension on every level and drilling down on the basic tenets of popcorn moviemaking...\"\r\n\r\nRead the full review here: http:\/\/screen-space.squarespace.com\/reviews\/2016\/6\/22\/independence-day-resurgence.html","url":"https:\/\/www.themoviedb.org\/review\/5769f7afc3a3683726001772"},{"id":"581cf459925141344d00134c","author":"Reno","content":"**The earthlings are united to defend the home from another alien attack.**\r\n\r\nI have said it many times that when I love a film, I always pray for a sequel to come. But I won't do that for all the films like perhaps 'Taken' and this one. These are not designed for that kind of a stretch or to own a franchise. So anyway they have made it and I'd watched. Since I was not expecting it, I did not care about the how it ends. I mean critically failed and the box office was okay, but did not meet the expectations. I mean not found anywhere near to the original film's collection.\r\n\r\nFor me, minus half point for the Chinese flavour. I think the Hollywood must stop leaning towards Chinese contents. It is like they are ignoring the rest of the world. I want the old days American films, not this yuan targeted films. Sorry, that is one of the reasons why I disliked films like this, 'Now You See Me 2' and many other recent sino-Hollywood films.\r\n\r\nThis story takes place 20 years later to the original film. Only a handful of characters returned and many of them were new. So now the humans leaped forward after adapting the alien technology. But when they learn the distress call was sent to the base of the enemy from the 20 years ago event, they are underprepared for another alien attack that follows very soon. Without any option they push their full force to defend the earth and it would they succeed or not is what the remaining film to reveal.\r\n\r\nNowadays the graphics are not an issue. The filmmaking had touched down for a standard in the visual quality, especially a big production like this. So those parts even overplay the performances of the real actors. We have seen that from Gollum, King Kong and many other monster films. So if you are watching a today's high end film means, it is a pleasure from the blow ups we expect the most. Similar to killings from the horror thrillers. This film does that so well, that mean it is entertaining, but not the overall film very praisable.\r\n\r\nThis story can be easily connected to many classics such as 'Star Wars' and 'Avatar'. Because how it ends seems like a story about the origins of those films. So the third film is like definitely takes us deep into the space. Looks very interesting, but does it work is the real question. It is already in the work with the same director. So lets wait and see how it corrects its mistakes. Meantime, you can watch this if you haven't yet, but it is an average film.\r\n\r\n_5.5\/10_","url":"https:\/\/www.themoviedb.org\/review\/581cf459925141344d00134c"}],"total_pages":1,"total_results":2}
{"id":246655,"page":1,"results":[{"id":"57acf03292514158840001b2","author":"Austin Singleton","content":"Not really a step forward in the X-Men franchise. Read my full review here.\r\n\r\nhttp:\/\/www.hweird1reviews.com\/allreviews\/x-men-apocalypse-review","url":"https:\/\/www.themoviedb.org\/review\/57acf03292514158840001b2"},{"id":"57d15d9e92514173a30094f2","author":"Gimly","content":"Though far from the worst _X-Men_ film, _Apocalypse_ was still a disappointment, because until this entry, every Bryan Singer _X-Men_ film had been excellent. _Apocalypse_ is a far cry from terrible, but it is underwhelming given Singer's history, as well as in and of itself.\r\n\r\nCertain actors, who shall remain Jennifer Lawrence, were completely checked out in this instalment. The CGI was often so bad it was confronting, even in the climax of the film. Apocalypse's plan was plot-hole-y and underdeveloped, and not all of the new characters hit it out of the park.\r\n\r\nThere was still a lot to like here though. Some of the newer costumes were neat, and a lot of the side-plots had me very intrigued. Fassbender and McAvoy are excellent as always. It's certainly not a failure amongst the likes of, for example, _X-Men: The Last Stand_. Which was a good callout in _Apocalypse_. Another thing I enjoyed.\r\n\r\n_Final rating:★★½ - Had a lot that appealed to me, didn’t quite work as a whole._","url":"https:\/\/www.themoviedb.org\/review\/57d15d9e92514173a30094f2"},{"id":"580e44b59251416e18001907","author":"Reno","content":"**Another ancient power was awoken and blah blah blah.**\r\n\r\nI have seen almost all the superhero films of the recent time, but this is the franchise I never liked. I'm sorry to say that, but that's the truth. The 'X-Men' series never made me sense, particularly to say it from the Marvel comics is a disappointment. When it comes to 'Wolverine', my opinion is different, because I loved those films. Hugh Jackman as Logan is the only 'X-Men' I love, so like usual this is another waste of time from its series to me.\r\n\r\nI even enjoyed the recently rebooted 'Fantastic Four', but not this one. There's nothing new in the story, it's the same plot stolen from the different films. Like an ancient force is awoken who tries to rule the world by destroying everything created so far by the humans. So the mutants join hands to bring him down and we know what happens at the end. Apart from the vfx, this is very boring film and 150 minutes runtime was another lengthy joke that you never laugh.\r\n\r\nNot just me, many people, even 'X-Men' fans showed displeasure over this film. That means, Bryan Singer's stint with the franchise is pretty much over. So they will going to bring a new one and that's another disappointment, because I don't know how long they're going to drag this series. End it already. Anyway, like I said I never was or will be this universe fan, so I don't care much, rather I just give them a try when they get released and obviously I'm to end in regret watching. Instead, I'm looking forward to the final 'Wolverine' film with Hugh Jackman.\r\n\r\n_5\/10_","url":"https:\/\/www.themoviedb.org\/review\/580e44b59251416e18001907"}],"total_pages":1,"total_results":3}
{"id":259316,"page":1,"results":[{"id":"583d5becc3a36835a200eb7d","author":"Gimly","content":"Struggles desperately to be three movies at once: One about Pokemon, one about proto-Voldemort and one (uncharacteristically dark story) about child abuse. But none of these three movies are bad movies so _Fantastic Beasts_ gets a pass from me. \r\n\r\nI was particularly fond of the degree to which it tied into the Harry Potter world at large. There were moments were I went “Oh Harry’s used that same spell before!” or characters that fitted naturally into the narrative being mentioned, as opposed to getting all _Agents of SHIELD_ season 1 on us, and awkwardly name-dropping something from the other films every 5 minutes, just in case we forgot, which was what I was afraid it might do.\r\n\r\nEnd result, _Fantastic Beasts_ is a flawed film that I was still very happy to have watched, and exceeded my expectations.\r\n\r\n_Final rating:★★★ - I personally recommend you give it a go._","url":"https:\/\/www.themoviedb.org\/review\/583d5becc3a36835a200eb7d"}],"total_pages":1,"total_results":1}
{"id":297761,"page":1,"results":[{"id":"57a814dc9251415cfb00309a","author":"Frank Ochieng","content":"Summertime 2016 has not been very kind to DC Comics-based personalities looking to shine consistently like their big screen Marvel Comics counterparts. Following the super-sized dud that was _Batman v. Superman: Dawn of Justice_ released a few months ago must really put some major pressure on Warner Bros. to gamble on ensuring that the presence of **Suicide Squad** does not meet the same kind of indifferent reception. Well, it turns out that although the anticipation was high for writer-director David Ayer's supervillain saga involving high-powered imprisoned rogues recruited as U.S. governmental operatives out to stop other skillful baddies (as it was for Zack Ryder's aforementioned \"Dawn of Justice\") the concoction of **Suicide Squad** feels like a colorful mishmash of collective misfits laboriously taking up space in a disjointed eye candy-coated spectacle that never manages to match its intended sizzle.\r\n\r\nOne would think that the premise for **Suicide Squad** would tap into the intriguing naughtiness with more robust gumption given the collection of super-powered oddballs asked to be immediate anti-heroes in this toothless jamboree of renegade rejects. Strangely, the grim and brooding presentation of **Suicide Squad** is more of an erratic downer than a hyperactive high-wire act as intended at the creative hands of Ayer. There is no reason why this lively group of adventurous agitators should appear so flat and inconsequential in a boisterous blockbuster that sporadically limps.\r\n\r\nGiven the twisted members that comprise this elite team of terrorizing tools it is very disappointing to see how **Suicide Squad** struggles with its so-called subversive themes. Sadly, this splattered mess never firmly grasps its bid for distinctive irreverence or off-balance exploitation. Instead, **Squad** feels strained in its execution and we are never really invested in entirely watching these treasured troublemakers find redemption because the story is soggy and uninspired. Furthermore, not all of the **Squad** participants are fleshed out satisfyingly for us to get behind with thirsty cynicism. The headlining leads in Will Smith's Floyd Lawton\/Deadshot, Oscar-winner Jared Leto's green-haired Joker and Australian beauty Margot Robbie's Harleen Quinzel\/Harley Quinn get the meaty standout parts while the lesser known supporting cast get stuck with chewing on the thankless remaining bone while seemingly acting as background furniture to the bigger names.\r\n\r\nNaturally, desperation has set in for the U.S. government as they need to safeguard national security against advanced sinister forces that threaten the fiber of American self-interests everywhere. What better way to hire gifted protection than to consider employing the world's most incarcerated corruptible, cutthroat cretins to perform the dirty work in unforgivable mission ops that require death-defying determination. Enter U.S. Intelligence agent Amanda Waller (Oscar nominee Viola Davis). Waller's duties are to assemble the ragtag team known as the Suicide Squad--ominous (yet talented) jailbirds tapped to step in and assume superhero status (especially when the real superheroes are tied up in other crime-stopping affairs) while helping out for the greater good of our vulnerable society. In exchange for the Suicide Squad's sacrifice in turning from hell-bent heels to reluctant heralded heroes they are promised commuted prison sentences should they effectively defend and destroy the deadly foes out to promote heavy-handed havoc across the board.\r\n\r\nConveniently, bureaucratic bigwig Waller (through voiceover) introduces the Suicide Squad and describes what beneficial assets they bring to the turbulent table. Among the naughty notables include the well-known ace sniper Floyd Lawton\/Deadshot as well as legendary lethal joy-boy Joker and his better (or perhaps worst half) in girlfriend Harley Quinn.
{"id":329865,"page":1,"results":[{"id":"584312a4925141676400049c","author":"Smashing UK Productions","content":"Prior to approaching this film, a word of warning that it is what many like to call a \"thinking person's sci-fi\". If you're going to watch this, I beg that you dedicate your utmost attention to it, as it is truly one rewarding experiences, one of the smartest, most well-constructed science fiction marvels of recent years. 'Arrival' is Villeneuve's magnum opus.\r\n\r\nFirstly, to put your mind at ease, I won't be analysing the plot, thus avoiding the use of spoilers. This decade, Villeneuve has crafted some fantastic works of art in the form of 'Prisoners', 'Sicario' and now this science fiction gem, and here's hoping his career further develops with more movie masterpieces coming our way. In a world where mysteries remain and the possibility of extraterrestrial life still stands unanswered, 'Arrival' approaches this with it's cliche-free take on the genre.\r\n\r\nThe relatively unknown Bradford Young provides the film with some of the most stunning cinematography ever conceived, taking advantage of the twilight hour to give the film its somewhat unique look, supported magnificently by Icelandic composer Jóhann Jóhannsson whose score is both haunting and beautiful. If you're someone looking for a science-fiction tale that keeps you guessing and thinking throughout, with fantastic performances, cinematography, music and near-flawless direction, then 'Arrival' is the film for you. The masterpiece of 2016!","url":"https:\/\/www.themoviedb.org\/review\/584312a4925141676400049c"}],"total_pages":1,"total_results":1}
{"id":284052,"page":1,"results":[{"id":"581bbdbbc3a36805c60001f1","author":"iheardthatmoviewas","content":"With each new Marvel film one could expect the studio to push the limits of what a superhero film should consist of. Films such as Captain America: Winter Solider, Guardians of the Galaxy and Ant-Man all consisted of elements that we have never seen within a superhero film before. Now, Marvel Studios attempts to push the envelop once more by leaving the world of high tech armors and super soldiers and entering the mystical world of magic. Leading this charge is Benedict Cumberbatch's Doctor Stephen Strange and hopefully he could answer why there is this strange mystical feeling that we have seen this all before.\r\n\r\n\r\n\r\n> From Marvel comes “Doctor Strange,” the story of world-famous neurosurgeon Dr. Stephen Strange whose life changes forever after a horrific car accident robs him of the use of his hands. When traditional medicine fails him, he is forced to look for healing, and hope, in an unlikely place—a mysterious enclave known as Kamar-Taj. He quickly learns that this is not just a center for healing but also the front line of a battle against unseen dark forces bent on destroying our reality. Before long Strange—armed with newly acquired magical powers—is forced to choose whether to return to his life of fortune and status or leave it all behind to defend the world as the most powerful sorcerer in existence.\r\n\r\nI am going to start off the review by discussing the only strong positive thing that came out of Doctor Strange and its by far the visuals. Beautiful vibrant colors pop at you throughout the film, the costume design is beyond extravagant and the framing is spot on. Doctor Strange and his fellow Sorcerers Supremes powers aren't fully on display until they enter the Mirror Dimension and my god, Tony Stark and Bruce Banner would hate this place. As they are men of science, they would hate that all rules of physics are thrown out the window as our Sorcerers Supremes are capable of breaking buildings apart and reforming to however they please. It is hard to not reference Inception but no one here is dreaming, these visuals are being created by the hand of mystical men and they use it to their power.\r\n\r\nIn all honestly, pushing the envelope when it comes to visuals was not a difficult task at all. Heck, if they didn't I would have been extremely disappointed as it was an obvious opportunity to take advantage of since we are dealing with magic. I am still extremely disappointed regardless as director Scott Derrickson completely missed another obvious opportunity to push the envelope this time in regards of character development.\r\n\r\nDoctor Stephen Strange is very much like a Tony Stark and other superheroes we have seen in films before as he is arrogant, egoistical and full of it. After Strange's accident in which he suffered extreme nerve damage to both hands, he dishes out every penny to his name to repair his hands in hopes he could continue his career as neurosurgeon. Every attempt fails and Strange becomes desperate enough to head to Nepal and finds himself under the guidance of Tilda Swinton's The Ancient One. Learning a whole new concept in the mystic arts forces Strange to reshape his way of thinking but Scott Derrickson does not let this have Strange reshape who he is as a person as well.\r\n\r\nDoctor Strange should have found himself being more like a Steve Rogers towards the end of the film as learning the mystic arts and his accident alone should have broken his ego. But instead everything still comes easy to him as he masters magic with ease with very little tension. He has a couple hiccups in the beginning but once The Ancient One puts him under her wing it is smooth sailing and Strange is stealing texts, wielding powerful weapons and defeating Supremes with decades of training with ease.\r\n\r\nYou cannot say that Strange was destined for the mystic arts and that is why everything came so easy for him.
{"id":324668,"page":1,"results":[{"id":"579cf601925141066e000c65","author":"Screen Zealots","content":"A SCREEN ZEALOTS REVIEW www.screenzealots.com\r\n\r\n**LOUISA SAYS:**\r\n\r\n“Jason Bourne” is a spy movie for imbeciles. The entire film feels like it’s written using nothing more than the vocabulary of a 12 year old and consists of two very tiring hours of repetition. Bourne gets chased, throws some punches, and gets away. Shoot, bleed, run, escape. Shoot, bleed, run, escape. Shoot, bleed, run, escape. Repeat to infinity.\r\n\r\nI actually felt bad for the actors having to deliver such dreadful dialogue; their onscreen characters literally describe everything that’s happening as it unfolds (“It’s Bourne!” and “I’m going to shoot!” and “He’s running upstairs!” and “The files are downloaded!”). At some point it started to get funny.\r\n\r\nMatt Damon is back as Jason Bourne and it feels like he’s sleepwalking through the entire movie. Even the talented Alicia Vikander phones in her questionable performance (is she supposed to have an accent or not?) and Tommy Lee Jones plays yet another scowling caricature of a sinister government official. There’s little in the way of character development and the only actor who’s enjoyable here is franchise veteran Julia Stiles. What a pity that she’s not given much to do.\r\n\r\nEven the action sequences are inexcusably incoherent. Paul Greengrass is one of my least favorite directors, mainly because he loves that fast cutting junk where I can’t tell what is going on in the movie. It’s a filmmaking style for those with short attention spans and it’s a sign of extreme laziness.\r\n\r\nGreengrass sucks all the fun out of what should’ve been a spectacular car chase down the Las Vegas strip. Instead of taking his time and showing off the pageantry of stunt driving with a steady hand (see the legendary cinematic car chases in Quentin Tarantino’s “Death Proof,” William Friedkin’s “The French Connection,” Peter Yates’ “Bullit,” Justin Lin’s “Fast Five,” or hell, even Michael Bay’s “Bad Boys II“), Greengrass once again opts for the lazy way out and gives us a messy commotion of three second snippets that seem to be edited together in a blender on the high setting.\r\n\r\nNone of the elements work: the film covers no new ground, it lacks any energy, and it simply feels tired, making “Jason Bourne” the lamest of all in the series.\r\n\r\n**MATT SAYS:**\r\n\r\n“Conversation” with 5-word sentences using spy and techno-jargon. Quick cut to person typing on computer: Beep, boop, beep. Quick cut to shaky cam conversation. Another five-word-sentence conversation and more shaky cam. Cut to shaky-cam motorcycle chase with no sense of geography. Cut back to computer.\r\n\r\nCut, cut, cut. Shaky cam, shaky cam, shaky cam. “Jason Bourne” might as well have been shot and assembled by a seven-year-old with ADD that hasn’t taken his Ritalin. It wasn’t so much edited as jammed together. So little artistry went into making this movie that it’s hard to even call Paul Greengrass its “director.”\r\n\r\nOne of my recurring rants is on the use of quick cutting and shaky cams in action films: it’s the hallmark of lazy filmmaking. When your action sequences are constructed by using cut after cut after cut, you don’t have to worry about storyboarding (contrast “The Raid: Redemption“). You don’t need actors who have any training in fight choreography (contrast “The Raid 2“). You don’t have to concern yourself with geography or spatial relationships. In other words, instead of having to WORK at creating a compelling action sequence, you can hack your way through it. And boy, there is NO ONE working in film now that loves hack action better than Paul Greengrass. And nowhere has Greengrass’s hackiness been on display more than in “Jason Bourne.” It’s his masterpiece of hacketry. I can continue making up new word forms using “hack” t
{"id":262500,"page":1,"results":[{"id":"55e003efc3a36826a40016c9","author":"Per Gunnar Jonsson","content":"As I did in my review of the first instalment, in this movie series I should probably point out that I have not read the books. Some people claim that this movie do not follow the books but, obviously, I cannot comment on that. So my review is based on the movie and the movie alone. I have to confess that I mostly watched this movie because I did watch the first instalment and felt obliged to see where the story went.\r\n\r\nThis movie have quite a few fairly cool special effects, especially the ones when Tris is in the virtual reality world trying to open the cube with the message to the inhabitants in the closed up city. Unfortunately this pretty much sums up the good parts of the movie.\r\n\r\nAs with Divergent I found this movie to be fairly mediocre. One reviewer said that this was a movie dumbed down for the teenage audience. Unfortunately I feel that he was right. Also unfortunately I think many teenagers are a lot smarter than Hollywood believe they are.\r\n\r\nThe plot is, well, mediocre. The acting is fairly meh. The main character, Tris, really lacks any form of charisma and spends most of the movie going around in some state of melancholy feeling sorry for herself and everything that happens around her. Apart from Four most of the people were behaving immaturely, cluelessly, froze up or panicked whenever something nasty happened and switched allegiances back and forth like you changed shirts.\r\n\r\nWhen Tris finally opened the cube I was expecting something cool and unexpected. What we got was a rather dull message about the city and its “purpose”. I complained in my review of divergent that we got absolutely no background information as to how the people had ended up in this ridiculous situation with a closed city and these factions that I still do not understand what they were supposed to solve. The message was supposed to explain this but it explained absolutely nothing except that the divergents were some kind of purpose or solution.\r\n\r\nThe ending? Well again this is a book series so it is not surprising that it ends in somewhat of a cliffhanger but it was really a cheap ending, one that you would expect from a TV series episode.\r\n\r\nSo I cannot say that I liked the movie very much. The virtual reality special effects scenes were fairly cool but that was about it.","url":"https:\/\/www.themoviedb.org\/review\/55e003efc3a36826a40016c9"},{"id":"5709098b92514147fc000dca","author":"Andres Gomez","content":"Briefing; this movie is just bad.\r\n\r\nThe first was not good either but this one continues the path open by the first. The special effects are quite noticeably rendered by computers and the actors are uncharismatic, other than that, the plot is just bad.\r\n\r\nAnother movie with quasi-teenager lead roles in a dystopic future in which stupidity is spread all along man-kind.\r\n\r\nWe just witness the struggle of our heroine with her self-imposed guilt with stupid enemies that let her survive at every moment so she can become the messiah she is meant to be.\r\n\r\nI think the only positive part I can get from this movie is the preeminence of strong and important female characters. Other than that, just skip it.","url":"https:\/\/www.themoviedb.org\/review\/5709098b92514147fc000dca"},{"id":"5787bc1792514131c0000c5a","author":"Reno","content":"> The mystery box and the power hungry leaders!\r\n\r\nThis is not a bad sequel, I quite enjoyed it, but I think I liked 'Divergent' better. The story continued a very short after where it ended in the first. In this part, it was all about power hungry where many try to get that top post. On the other side, there will be an attempt to open a mystery box that found which might reveal some important detail about them.\r\n\r\nLooked like a very good storyline, unpredictable stuffs, but not utilised to its full potential. Though the actors were good, especially Shailene was sexy in her shor
{"id":76341,"page":1,"results":[{"id":"55660928c3a3687ad7001db1","author":"Phileas Fogg","content":"Fabulous action movie. Lots of interesting characters. They don't make many movies like this. The whole movie from start to finish was entertaining I'm looking forward to seeing it again. I definitely recommend seeing it.","url":"https:\/\/www.themoviedb.org\/review\/55660928c3a3687ad7001db1"},{"id":"55732a53925141456e000639","author":"Andres Gomez","content":"Good action movie with a decent script for the genre. The photography is really good too but, in the end, it is quite repeating itself from beginning to end and the stormy OST is exhausting.","url":"https:\/\/www.themoviedb.org\/review\/55732a53925141456e000639"},{"id":"55edd26792514106d600e380","author":"extoix","content":"Awesome movie!  WITNESS ME will stick with me forever!","url":"https:\/\/www.themoviedb.org\/review\/55edd26792514106d600e380"},{"id":"5654a732c3a368176600023d","author":"Cineport","content":"Fantastic action that makes up for some plot holes.","url":"https:\/\/www.themoviedb.org\/review\/5654a732c3a368176600023d"},{"id":"57162d35c3a3682f450038b2","author":"balumahendran","content":"Wonderful action movie. Scenes are unimaginable. Lots of graphics used in this movie. This is totally a very good action movie.","url":"https:\/\/www.themoviedb.org\/review\/57162d35c3a3682f450038b2"}],"total_pages":1,"total_results":5}
{"id":271110,"page":1,"results":[{"id":"572d7bc1c3a3680fdb001d69","author":"Frank Ochieng","content":"Well another super-sized Marvel Comics superhero saga hits the big screen with the selected savior Captain America taking the top billing on the marquee. Thus, the pulsating popcorn pleaser **Captain America: Civil War** arrives on the scene to giddy audiences that have been loyal and fixated on the successful spring of mighty Marvel heroes that have been paraded to viewers throughout the last few years. Thankfully, **Captain America: Civil War** carries on the tradition of spry superhero-studded spectacles that have been glorious and adventurous from the stable of Marvel-based movies guaranteed to win over the enthusiastic hearts of avid comic book fanboys everywhere. Joyously overstuffed and convincingly extensive with a super team armed with crime-fighting excess, **Civil War** seizes the moment to introduce a noteworthy twist: two factions of rescuing superpowers engaging in some explosive in-house fighting led by two of Marvel Comics main standouts in Chris Evans’s Captain America and Robert Downey Jr.’s Iron Man.\r\n\r\nCo-directors Anthony Russo and Rene Russo were instinctively crafty to link the overly successful Iron Man film franchise to the **Captain America: Civil War** inner circle to ensure an even more treasured toxic atmosphere. Superhero fans will get a thrill of witnessing the extra add-ons concerning other dynamic titans to join the action-packed festivities involving Team Captain America versus Team Iron Man. True, **Civil War** has its share of flaws but that does not take away from this heroes-in-crisis flick demonstrating its ambitious overtones.\r\n\r\nSo what has caused the bad blood among the great and grand good guys known for protecting the world from evil dominance and destruction? Essentially the theme of collateral damage, the involvement regarding civilian-related deaths and injuries plus the world-wide backlash has created a controversy pitted against The Avengers. Specifically, Captain America (a.k.a. Steve Rogers) and Scarlet Witch\/Wanda Maximoff (Elizabeth Olsen)  are responsible for the boisterous battle that caused such negative sensation resulting in political turmoil. Avengers head honcho Iron Man (a.k.a. Tony Stark) is dealing with his own personal regrets in the ill-advised creation of the unpredictable Ultron. The political authority want to hold Iron Man, second-in-command Captain America and the rest of the Avengers accountable for the global devastation that have taking its toll when trying to oversee the potential harm wreaking havoc on humanity.\r\n\r\nLeading the charge in putting a watchful eye on the labeled reckless Avengers is Secretary of State Thaddeus Ross (William Hurt) that suggests the super group be monitored by the United Nations. Naturally friction develops between the superheroes that either agree with Ross’s UN restriction policies or disagree with being placed under a microscope that threatens to handcuff their free-wheeling heroic duties. All these contrasting beliefs eventually turn into epic back-and-forth confrontations where the raging Avengers are at odds with each other.\r\n\r\nFor Stark\/Iron Man’s stance, he is willing to toe the line and ultimately agree that his crew needs to tone down their tenacious tactics as crime-stoppers. Iron Man’s consciousness, particularly in the case of a disillusioned mother (Alfre Woodward) making him feel guilt-ridden over her son’s death during an intense Battle of Sokovia, is probably the main factor behind his decision to have his team reigned in a bit from the political watchdogs. Siding with Iron Man’s viewpoint are the likes of Black Widow (Scarlett Johansson), Vision (Paul Bettany) and War Machine (Don Cheadle). As for Rogers\/Captain America, he is not too thrilled being put in check by the intrusive governmental pencil-pushers that want to scrutinize the team’s every move. Standing with Captain America firmly are Falcon (Ant
{"id":267935,"page":1,"results":[{"id":"573800a8c3a36864be00071b","author":"Screen-Space","content":"\"The only element of the entire production that inspires any kind of wonder is just how far from a satisfying adaptation the film proves to be...\"\r\n\r\nRead the full review here: http:\/\/screen-space.squarespace.com\/reviews\/2016\/5\/15\/the-bfg.html","url":"https:\/\/www.themoviedb.org\/review\/573800a8c3a36864be00071b"}],"total_pages":1,"total_results":1}
{"id":207932,"page":1,"results":[],"total_pages":0,"total_results":0}
{"id":188927,"page":1,"results":[{"id":"57932005c3a368636b006bd1","author":"Frank Ochieng","content":"Some diehard **Star Trek** fans may not necessarily feel that the Justin Lin-directed third installment of this science fiction\/space saga film franchise “boldly goes where no man has gone before” creatively. Surprisingly, Lin (director of two “Fast & Furious” flicks) shows some engaging and intriguing heft in **Star Trek Beyond** as the adventurous exploits of the USS Enterprise crew are likely to stir the collective pot where the nostalgic sentiments of the Star Trek brand from yesteryear bridges the gap to the current cinematic explosiveness of modern-day Captain Kirk and company. Although it is extremely difficult to immediately dismiss filmmaker J.J. Abrams’s resourceful fingerprints concerning the imaginative **Star Trek** (2009) and the thoroughly enjoyable **Star Trek Into Darkness** (2013) he graciously steps aside to allow Lin’s energizing directorial vision to further explore Trek mythology on the big screen.\r\n\r\nEssentially, **Star Trek Beyond** is a vibrant cosmic canvas that is expansive in its boundaries of exploration. Visually arresting, well-paced and armed with compelling story-telling and a healthy dosage of curiosity and mystery, Lin manages to stay true to the traditional Trek-oriented universe by incorporating rousing special effects and offering a galactic grandeur of planetary peculiarities and exotic alien races to stimulate the exquisite narrative. Screenwriters Doug Jung and Simon Pegg (Star Trek’s on-screen character Montgomery “Scotty” Scott) incorporate an eye-opening mixture of dramatic edginess, off-the-cuff humor and the cohesive rapport among the cast-mates that have inherited the iconic Star Trek personalities and made these familiar faces from the classic 60’s TV show and previous non-reboot films a revelation in the millennium age of blockbuster sci-fi action adventure.\r\n\r\nThe plot channels in a sense of challenging malaise for the USS Enterprise’s top officers in Captain Kirk (Chris Pine) and Commander Spock (Zachary Quinto). What seemingly spices things up regarding the deja vu space journeys aboard the spacecraft is the questionable and powerful device that Kirk and his crew are babysitting. This powerful tool of destruction is capable of destroying humanity as we know it. In particular, the opportunistic Krall (Idris Elba) is the lizard-looking culprit determined to get his diabolical hands on the corrosive contraption. Naturally, Krall and his menacing minions must subdue Kirk and his crew to achieve success in having this ominous object in his deadly grasp. Krall’s willingness to cripple the USS Enterprise proved to be an ambitious mission fully accomplished. For Kirk and his group the results were disheartening as Krall’s forceful attacks rendered the ship disabled as it crashed on the desolate planet of Altamid. Thus, Kirk and his charges are stranded on his rocky haven with no hope in sight. The harsh reality for the vulnerable USS Enterprise visitors, besides being divided and scattered in all directions on this problematic planet, involved getting into survival mode as the hostile reptilian creatures surrounded them at will.\r\n\r\nThe aforementioned split of Kirk and his exposed cohorts called for a series of various crisis carried on at different, chaotic spots. Kirk and Russian crew member Pavel Chekov (played by the late Anton Yelchin) were primarily tasked with trying to rescue their colleagues from the claws of Krall and his cronies. Elsewhere, Dr. Bones (Keith Urban) tries to patch up the injured Spock following the aftermath of the ship’s wrecking. Pegg’s Scotty and womanly warrior in alien Jayla (Sofia Boutella) make the valiant effort in trying to reach Kirk in the middle of total ribaldry.\r\n\r\n**Star Trek Beyond** has stylized flash and Lin ensures that his pulsating production stays faithful to the Trek legacy. Sure, **Beyond** is not anything innovative o
{"id":294272,"page":1,"results":[{"id":"57ae94b0c3a36872780008a2","author":"Frank Ochieng","content":"The infectiously whimsy and adventurous **Pete’s Dragon** undergoes a polished millennial-style rebirth for today’s kiddies not fortunate enough to be alive when the 1977 live-action animated musical blueprint made its charming, impressionable impact for youngsters of all ages back in the day. The festive and frolicking Disney flourishes are applied to co-writer\/director David Lowery’s re-imagination of an impish boy and his devoted dragon. There is an even balance of refreshing nostalgia and modern-day spryness and magical sentiment that hovers over this engaging family fable remake from the polyester period. Lowery (2013’s “Ain’t Them Bodies Saints”) and screenwriters Toby Halbrooks and Malcolm Marmorstein pack some vibrant punch of wonderment into this children’s tale of gentle mischievousness. Sure, the simplistic approach to the storytelling feels like a step-by-step progression experienced in a majority of child-friendly escapist entertainment. Still, **Pete’s Dragon** is steady in its gentle precision for homespun high jinks. \r\n\r\nWhether appreciating this Disney classic from four decades ago or relishing in Lowery’s current contemplative spectacle one will agree that the heart and soul of this sweet and uplifting narrative remains true to the main factors involved: the runaway (now orphaned) boy Pete and his trusty creature companion Elliot. In fact, it is just as instrumental that the adult presence in **Pete’s Dragon** make an impacting impression as well because this exposition should cater to the delicate sensibilities in us all whether as a curious tyke or reflective grown-up.\r\n\r\nOrphaned and alone, 10-year old Pete (Oakes Fegley) had become a wild child in the deep woods. What was looking pretty grim for Pete in terms of loneliness, abandonment and despair was soon cured when he ended up befriending a giant green furry high-flying dragon named Elliot. For the most part the imposing Elliot served as Pete’s surrogate parent while ensuring protection and friendship for the parent-less prepubescent. There is no question about the dependency that Pete and his dragon Elliot share in loving dependency. The scenic wooded haven serves as the treasured playground for the playful, nature-loving tandem.\r\n\r\nEnter the father-daughter duo of Mr. Meacham (Robert Redford) and Grace (Bryce Dallas Howard). Both strangely have an eerie connection to Pete’s and Elliot’s existence without realizing it. Meacham had been telling engagingly colorful stories to the local children about a mysterious dragon existing in the Northwest Pacific woods. As for Grace she happens to be employed as a Park Ranger for the site of the mentioned woods her father constantly references in his repetitive stories. Soon Grace will encounter the disheveled Pete who is more than willing to share his adventures of living in the thick woods with his massive dragon buddy Elliot. This all seems rather intriguing to Grace because Pete’s description of Elliot is curiously similar to the fictional monster that Meacham cites to the spellbound youngsters. Whatever the case may be regarding Pete and his personalized plight this is something that Grace must investigate.\r\n\r\nGrace is not the only one who finds the wandering Jungle Book youthful clone intriguing. Both Grace’s fiance Jack (Wes Bentley) and 11-year old Natalie (Oona Laurence from “Southpaw”) are in awe of Pete as well. In any event, Grace and Natalie are determined to find out what lies beneath the surface with the boy and his behemoth sidekick dragon that recalls Meacham’s exaggerated tall tales.\r\n\r\n**Pete’s Dragon** dutifully follows what amounts to be the on-going formula for escapist children’s storybook gems as recently told on the big screen. The reliable source of pathos and warmth wisdom stems from a vulnerable child in search of belonging especially when trying to loca
{"id":157336,"page":1,"results":[{"id":"5463856c0e0a267815002598","author":"Reno","content":"Well, one off from two of this year's most expected movies alongside 'The Battle of Five Armies'. Like all the Chris Nolan fans, I was equally excited to see the movie on the opening day opening show. But I slightly disappointed that it was not a digital 3D film. I agree, this science-fiction was more dramatized than usual space travel stories does with an adventure-thriller. Almost a 3 hour long stretch movie did not waste much time to take us to the core of the story. Get prepared for this extremely rare voyage into the space with a logical explanation for everything you see on the screen. Well done research for the most matured and intelligent writing. All the credit must go to Nolan brothers. A good sign from Jonathan Nolan, who can make big in the entertainment industry in a future like his brother.\r\n\r\nAs we know many had liked 'Inception', to me that was a simple multi-layered action movie, that's all. But the same stuffs that used in this film makes sense. In fact, you have to have a little knowledge over how the universe works, so then it will be easy to catch the scene and situations while watching the movie. Totally like a documentary style concept, but with the additional stuffs like characters and its emotions add flavor that gives a movie look. An educational movie, though it also can work for those who wants just entertainment. Only the slow movie pace would test their patience.\r\n\r\nIt all begins like Shyamalan's 'Signs' movie with a family living surrounded by corn field. Then switches to 'The Astronaut Farmer' and going through 'Gravity', finally meets the 'Inception'. It was just a reference to call the movie setting that brings constant change for every half an hour. Like the opening scene and the end scene had over a 100 years difference.\r\n\r\nAs I earlier said it was the story of a family alongside the future of humankind and decoding universal mysteries through travelling in space and time. This movie would a reasonable for those who thought '2001: A Space Odyssey' is a boring piece, Cleverly written cinematic piece especially for science geeks. I don't know how perfect the movie to the actual present astrophysics, but will justify for the common people's capacity of understanding with an encourageable amount of commercial elements in it to entertain as well.\r\n\r\nThe first three quarters of the movie was well made. It puts me in a unblinkable position like a story was narrated by Brian Cox in a television series. Like I said, lots of astrophysics involved in it, but strangely human emotions were also exhibited equally that I never expected one from Nolan film. It was not an ordinary sentiment, but was strong enough to make a man cry for happy and sad situations in the movie. I liked science and emotion coming together. In fact, it saved the movie, otherwise it would have been a science documentary straight from NASA production through Nolan direction.\r\n\r\nThere are many surprise elements in the movie and of course there is a twist at the end. We can call it a series of twists like the layers. Compared to last quarter of the movie to the rest, it completely detaches which opens broadly to the different directions. And that happens so fast rushing towards the other end. Which give an impression of the movie 'Inception'. In a perfect way to say the first 75% was 'The Tree of Life' and the remains are 'Inception'.\r\n\r\n‘‘This world's a treasure,\r\nbut it's been telling us to leave for a while now.’’\r\n\r\nAll the actors were so good. Matthew McConaughey steals the show as he dominates the majority of the screen space in the story presentation. There's no ruling out the fine performance executions from Anne Hathaway and the young star from the Twilight movie, Mackenzie Foy. The remaining cast was having less scope which were like the guest appearances that was widened a little broader, but was perfectly fitted for the stor
{"id":328111,"page":1,"results":[{"id":"579cfaac9251411b36008316","author":"Screen Zealots","content":"A SCREEN ZEALOTS REVIEW www.screenzealots.com\r\n\r\nAnyone who is fortunate enough to share their life with a companion animal will undoubtedly get a kick out of the latest Illumination animated effort, “The Secret Life of Pets.” The film soars when it focuses on animals interacting with their human guardians, with the canine and feline characters acting like real pets do (if my cats could talk, I’m sure they’d converse in  similar dialogue as portrayed onscreen). The first part of the movie is incredibly perceptive and clever, as is the last 10 minutes because it zeroes in on these very relationships (the opening and closing scenes of the movie are touching and have lots of heart). The problem comes in the middle when the story stops being about ‘pets being pets.’ Sadly, the majority of the film lags when it ventures into the dreaded animated movie territory of sheer stupidity.\r\n\r\nLoveable human Katie (Ellie Kemper) and her pup Max (Louis C.K.) are the best of friends. Max has several animal buddies that live in the same New York City high rise, including dogs, cats, birds and guinea pigs that stop by for daily visits. When Katie brings home Duke (Eric Stonestreet) from the animal shelter, Max devises a plan to get rid of him. Problem is, the two dogs find themselves lost in the big city and Max’s would-be girlfriend Gidget (Jenny Slate) takes it upon herself to recruit other pets — including the elderly paralyzed basset hound Pops (Dana Carvey) and lonely falcon Tiberius (Albert Brooks) — to bring Max home. Along the way they find themselves at odds with the anarchist gang of “flushed pets,” a group of outspoken, anti-human animals led by former magician’s bunny Snowball (Kevin Hart).\r\n\r\nThe voice acting runs the gamut from phenomenally good (Slate) to wince inducing (Hart). Slate is perfectly cast as Gidget, a poufy white spoiled little dog who eventually saves the day. She proves herself tenfold as a legitimate voiceover actor, and I hope to see her get more work in animation in the future. There’s no denying that Hart is a super likeable actor, but his portrayal of Snowball the bunny is nothing more than repeated, strained yelling. His overall performance felt so labored and unnatural that listening to him onscreen actually made me uncomfortable. I will not hesitate to nominate Hart for a Razzie award for worst actor of the year because his voice work is that bad.\r\n\r\nIn the ‘oh no, not again’ category, there’s plenty of dopey, brainless scenarios crammed in with a feeling that their sole existence is to appease young kids. We get yet another ridiculous animal driving a car stunt that we had to endure in this summer’s nearly insufferable “Finding Dory.” In fact, in “The Secret Life of Pets” we get not only a rabbit driving a van but also a lizard driving a bus and a pig driving a taxi.\r\n\r\nThe absurdity isn’t the only problem: it’s the repetition. The filmmakers must’ve run out of good ideas and instead of moving the story forward, the audience gets the same monotony over and over and over again. I don’t require my animated films to be completely based in reality (there’s a particularly amusing Busby Berkeley inspired musical sequence in a sausage factory), but I do expect more originality than is delivered in this movie. The story at times takes a cynical approach in several places and some of the themes may be too much for sensitive kids (but the film provides a great starting point for a learning opportunity about pets and how animals shouldn’t be viewed as disposable).\r\n\r\nAt least the animation is commendable, nice and colorful with lively, fully realized backgrounds. It’s visually interesting enough for adults and fans of the genre but it’s also vibrant and bustling enough to keep the kids interested. There’s a lovely original score with a lighthearted, almost vintage
{"id":43074,"page":1,"results":[{"id":"57846b3792514121bd003696","author":"Screen-Space","content":"\"While it falls short of nailing the anarchic spirit and character chemistry of Ivan Reitman’s beloved 1984 blockbuster, Feig and his cast of game comediennes deliver enough thrills and giggles to both justify the long-in-development franchise-starter and smother the internet’s white noise of negativity...\"\r\n\r\nRead the full review here: http:\/\/screen-space.squarespace.com\/reviews\/2016\/7\/12\/ghostbusters.html","url":"https:\/\/www.themoviedb.org\/review\/57846b3792514121bd003696"},{"id":"5789be5892514163c4000747","author":"Frank Ochieng","content":"Filmmaker Paul Feig's **Ghostbusters** reboot pretty much followed the characteristic aspects of his previous films (\"Bridesmaids\", \"The Heat\", \"Spy\") all incorporating a self-awareness of female-oriented friendship and the estrogen-driven escapades rooted in inspired goofiness. So given this familiar foundation of Feig's big screen blueprint one would expect that his creative input into the continued Ghostbusters franchise for the millennium moviegoers would result in the heralded hype his film project is now enjoying at large. Sure, the feminine-charged **Ghostbusters** seemed like a radical concept and would obviously trigger the nostalgic sentiments (and comparisons) of the classic 80's comedy spearheaded by beloved on-screen paranormal hucksters Bill Murray, Dan Aykroyd, Harold Ramis and Ernie Hudson. Nevertheless, singer Ray Parker Jr.'s lyrical catchphrase \"Who you gonna call?\" within the Ghostbusters theme song needs to be addressed accordingly. The answer: the handlers behind the original **Ghostbusters** film that could uplift the disjointed high jinks and synthetic silliness of Feig's current comedic ghostly she-power schlockfest.\r\n\r\nIt is only natural that **Ghostbusters** had high expectations for Sony Pictures to perform well given the aggressive marketing tactics, early release of the Ghostbusters movie trailer (which was heavily panned online) and the aforementioned cinematic legacy of the original film's fanatical following and reputation. However, this third installation of **Ghostbusters** feels curiously flat and strained in its stillborn witticism. The creep factor borders on campy and cheesy (although this effectively worked for Ivan Reitman's 32-year old spook-ridden farce in the eighties) for which in today's cinematic circle is inexcusable due to the edgier and challenging special effects that could have played up the whimsy and wonderment of this breezy, bubble-gum colored romp with seemingly low-grade spark and sizzle.\r\n\r\nFeig's interpretation of the **Ghostbusters** universe could have been fresh and favorable especially with the colorful casting of his capable four female principals in the Emmy-winning and Oscar-nominated Melissa McCarthy along with Saturday Night Live personalities Kristen Wiig, Kate McKinnon and Leslie Jones. Unfortunately for these noted funny ladies they were saddled (or slimmed if you will) by a transparent script almost as invisible as the pesky ghosts they are trying to pacify. The recycled by-the-numbers hilarity and hysteria does not make this brand of ghost-busting quite distinguishing. Chemistry-wise, the Ghostbuster gals seem to revel in the collective merry-minded mischievousness and genuinely try to bring energy and outrageous antics to this flaccid frightfest. Still, the mixture of Ghostbusters' gooey gumption with a dash of egghead feisty femininity never seems to translate into anything beyond the tired gimmick of promoting another excuse to tap into yesteryear's profitable fun and frolic that made the wise-cracking Murray and his klutzy cohorts so amusing and welcomed in their rollicking ghostly gem from the Reagan-era.\r\n\r\nQuite frankly the notion that **Ghostbusters** is unfairly being knocked for its misogynistic overtones fueled by bias Internet-based fanboys not accepting that nerdy womanly scientists cannot fill
{"id":127380,"page":1,"results":[{"id":"5835dce5c3a3682fad019c4a","author":"Reno","content":"**Before Nemo, a long ago another child got lost in the open ocean...**\r\n\r\nWhoa! 200 million dollar film, 1 billion box office collections worldwide. The 27th film to do that so and the 5th animation film. This sequel was made after 13 years, surely a long gab, but 'Finding Nemo' was one of my favourite animations, tell me who does not love it those who love animation. Nevertheless, I liked the idea of having a sequel, but I scared it would go to flop terribly. Now, after watching this, I totally stunned. This is not a greatest animation ever made, but the way the screenplay handled, along with other stuffs, this makes one of the best among its kind.\r\n\r\nFirstly, when I heard the sequel's title, it made me laugh. Like, whaaaat? Once again the story is going to repeat. I did not think it would bring a big change. Actually, it was a different tale, especially I was not expecting it to be emotional. Tell me how many tearjerker-animation you have seen. Once again the Disney-Pixar jointly did it. I think appreciation must go to the director who also made the original film. Great casting too, I mean the voice- over artists.\r\n\r\nWe know that Dory is severely suffering from the short term remembory (memory) loss. Now this tale is going to reveal her backstory. From her childhood to till she meets Marlin and then Nemo, there was a series of forgotten events. She slowly regains some of those memories and begins her quest to find out more. This is where she gets lost, but the title defines that she was lost before and now looking a way to get back where she really belongs.\r\n\r\nFor me, after 'Frozen', this film is what emotionally got me. The value of having family and friends beautifully disclosed. It might be an animation, but still a meaningful story from many perspectives. Lots of new characters were introduced and those were really cool ones. I expect theirs short animations to make its way about their origins, particularly Hank the octopus and his story about how he lost one of his tentacles.\r\n\r\nThe Oscars is the quarter of a year away, but releasing nominees would come weeks ahead. So it's about time to learn where this one fit in. But I'm anticipating close contest between this, 'Zootopia' and 'Red Turtle'. Coming back to the review, this is a good watch, for everybody, so I highly recommend it. I hope there will be a third film, but like I had felt before this, I desire it and then I'm not sure it would extend its legacy to further. So fingers crossed!\r\n\r\n_9\/10_","url":"https:\/\/www.themoviedb.org\/review\/5835dce5c3a3682fad019c4a"}],"total_pages":1,"total_results":1}
{"id":277,"page":1,"results":[],"total_pages":0,"total_results":0}
{"id":135397,"page":1,"results":[{"id":"55910381c3a36807f900065d","author":"jonlikesmoviesthatdontsuck","content":"I was a huge fan of the original 3 movies, they were out when I was younger, and I grew up loving dinosaurs because of them. This movie was awesome, and I think it can stand as a testimonial piece towards the capabilities that Christopher Pratt has. He nailed it. The graphics were awesome, the supporting cast did great and the t rex saved the child in me. 10\\5 stars, four thumbs up, and I hope that star wars episode VII doesn't disappoint,","url":"https:\/\/www.themoviedb.org\/review\/55910381c3a36807f900065d"},{"id":"559238f89251415df80000aa","author":"Ganesan","content":"Overall action packed movie... But there should be more puzzles in the climax... But I really love the movie.... Excellent...","url":"https:\/\/www.themoviedb.org\/review\/559238f89251415df80000aa"},{"id":"5639d6cd9251416d5201312c","author":"redTed","content":"I've never been a fan of this series. The only impressive thing of the original was the graphics that were, at the time, breathtaking. But we all know great graphics alone can't save a film. \r\nI watched this new effort just to see how far CGI has come in the time since the original and I can safely say, not very far. From the opening scene with the terrible looking and poorly animated bird, it's obvious that CGI has reached its limits in recreating realistic content. \r\nAs for the film. The dreadful script and annoying characters helped me lose any interest after about 15 mins. Ok for the age range it's aimed at I suppose, but there are far better films out there worthy of your money.","url":"https:\/\/www.themoviedb.org\/review\/5639d6cd9251416d5201312c"},{"id":"56544b11c3a36850fa003fcc","author":"John Chard","content":"Untamable Devil.\r\n\r\nOne thing that would be 100% guaranteed prior to the release of Jurassic World, is that whatever the quality, or lack of, the notices would be mixed. Thus the reactions would be akin to those that Indiana Jones 4 received, charges of ruining childhoods and franchises etc.\r\n\r\nJurassic World does exactly what is expected of it, it's a popcorn blockbuster that plays out as mindless fun, complete with outstanding effects, monster mayhem and moments of dumbness. In fact it's very much a safe sequel, reverting to the original formula without the classy edges of Spielberg's deft touch.\r\n\r\nThere's a likable cast fronting up the pic, with Chris Pratt as the hero carrying some olde adventure chops about him, and Bryce Dallas Howard (her natural beauty sparkling on Blu-ray) a fun femme side-kick. The writers introduce a couple of new mighty monsters to the series, hell of beasties for sure, while the photography, stunt work and musical score all impress greatly.\r\n\r\nThe Velociraptor plot line is crummy and daft, almost as daft as Bryce's high heels character arc, and the familiarity factor does grate a little at times, but it's a rollicking good time not to be taken remotely seriously like it's some sort of series disgrace. 7\/10 ","url":"https:\/\/www.themoviedb.org\/review\/56544b11c3a36850fa003fcc"},{"id":"56daade3c3a3684cae001628","author":"kendsley2003@yahoo.com","content":"All in all this movie brought back the franchise that started out and captured the worlds attention. From the T-Rex chasing them down the road in there jeep to the velociraptors stalking them and picking them off one by one. \r\n\r\nJurassic World brought the franchise back to the state of reality. (If dinosaurs were real, this would be the set up for a park and containment of dinosaurs).\r\n\r\nChris Pratt did a great job on not only playing his part but looking it as well. Mis. Howard did ok. It seemed like she stumbled through most of her scenes and didn't bring key emotional expressions or reactions to the scene moments. But with her OCD and control issues played up against Mr. Pratt it brought the key relationship to tie the movie together. \r\n\r\nThis is a must see movie!","url":"https:\/\/www
{"id":131631,"page":1,"results":[{"id":"547e6075c3a368256200022f","author":"anthonypagan1975","content":"It was good. Although I wish it had more action scenes. It's worth watching ago don't miss out!","url":"https:\/\/www.themoviedb.org\/review\/547e6075c3a368256200022f"},{"id":"54d9b29c9251410a4500100a","author":"Andres Gomez","content":"Yet more of the same extended in an inexcusable way. Let's hope the last movie of the saga can get a proper end.","url":"https:\/\/www.themoviedb.org\/review\/54d9b29c9251410a4500100a"}],"total_pages":1,"total_results":2}
{"id":277834,"page":1,"results":[],"total_pages":0,"total_results":0}]}
